{
"東北風":["此類風向盛行於冬季，且風力相對較強。\n中部以北及東半部擴散條件相對較佳，空氣污染相對集中於高屏地區。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_1.jpg"],
"偏東風":["在高壓出海轉高壓迴流期間，臺灣附近風向逐漸由東北風轉為偏東風。\n該風向容易因臺灣地形產生「地形繞流」。 \n此現象容易在臺灣海峽上產生一背風渦旋， \n它可能將原已擴散至海面上的污染物又再度帶往陸地，易使局部地區空氣污染物濃度上升。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_3.jpg"],
"偏南風":["較常發生於夏半季，當臺灣附近風向為南風、南南東風或偏南風時，高屏及雲嘉南空氣品質通常較中部以北良好。\n此外，當高屏地區在較強的南風吹拂之下，高屏溪易有揚塵現象發生。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_5.jpg"],
"西南風":["夏季盛行的西南風通常夾帶較多水氣。\n普遍來說高屏及雲嘉南位於上風處且易有降水現象，因此空氣品質良好。\n而北部位於下風處，污染物易累積於此，相對之下空氣品質較差。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_6.jpg"],
"偏西風":["當臺灣附近風場為西風或偏西風時，\n西半部的空氣污染物不易往海面上移動、擴散，反而往中央山脈及內陸區域堆積，\n因此在此型態風場，西半部空氣品質相對差。\n而宜蘭位於背風側且風力通常偏弱不利污染物擴散，空氣品質也略差。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_7.jpg"],
"背風面":["當風遇到地形阻擋時，地形正對風向的一側稱為迎風面，背對風向的一側稱為背風面。迎風面空氣流動較佳，大氣擴散條件較好，有相對好的空氣品質；背風面則因空氣流動較少，擴散條件相對較差。","https://airtw.epa.gov.tw/images/pedia/pedia2_6_1.png"],
"下風處":["在空氣品質的探討中，粒狀污染物隨空氣流動、並隨著風吹往下風處，當下風處位於內陸、靠山區或是擴散條件較差時，粒狀污染物容易累積，使空氣品質相對於上風處較差。","https://airtw.epa.gov.tw/images/pedia/pedia2_6_2.png"],
"弱風環境":["當大氣中風速偏弱時，空氣流動較差，若有空氣污染物排放源，則使當地較易累積污染物。","https://airtw.epa.gov.tw/images/pedia/pedia2_6_3.png"],
"背風渦旋":["當氣流遇山脈或地形阻擋時，在山的背風面容易形成渦旋，渦旋的方向則不一定。當背風渦旋出現時，污染物常隨著氣流繞進此渦旋，造成污染物易累積。","https://airtw.epa.gov.tw/images/pedia/pedia2_6_4.png"],
"河川揚塵":["當河道水位降低出現河床裸露，此時河床上細小的顆粒容易被風揚起，形成揚塵現象，進而影響當地以及下風處的空氣品質。河川揚塵好發時間通常在白天中午至傍晚風速較強的時段，當河川揚塵發生時，空氣污染物濃度可能在短時間內快速上升，但當風速減弱時，污染物濃度則又隨即降低。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_20.jpg"],
"光化反應":["人為排放的氮氧化物及易揮發性的有機物等空氣污染物因大氣中光化學作用生成臭氧等衍生性空氣污染物，光化反應產生與否與紫外線強度有關，當白天雲量偏多則不利於光化反應作用，反之雲量偏少則有利於光化反應產生，特別是在炎熱、陽光普照的情況之下，會使空氣中的臭氧濃度升高，進而影響空氣品質。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_21.jpg"],
"境外汙染":["由於臺灣位於東亞大陸空氣污染物傳輸路徑上，當東北季風盛行時，常夾帶上游的空氣污染物透過長程傳輸經過臺灣地區，進而影響臺灣的空氣品質。","https://airtw.epa.gov.tw/images/pedia/pedia3_3_1.png"],
"降雨洗除作用":["大氣中空氣污染物濃度因降落的雨滴洗除，但降低程度仍會受降雨強度、降雨延時、風速或附近有無污染排放等因素而定。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_10.jpg"],
"混合層高度":["混合層高度是指空氣污染物在混合層中垂直方向可擴散的高度，可表達環境大氣對空氣污染物傳輸與擴散的效果，白天溫度較高，垂直對流混合的範圍較大，使混合層高度較高，表示空氣中的污染物可擴散的垂直範圍愈大，愈容易被大氣所稀釋，因此有助於降低近地面的污染物濃度，反之夜間因溫度較低，垂直混合程度較低，因此混合層高度低，不易將污染物向垂直方向擴散。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_22.png"],
"沉降作用":["若近地面有沉降氣流或是沉降逆溫時，則表示大氣垂直擴散條件不佳，污染物容易累積於近地面造成濃度上升。最常見的氣流下沉運動是當高壓籠罩或是颱風的氣流所造成的過山沉降，下沉運動可抑制垂直對流，使天氣較為穩定，大氣穩定度較高，因此擴散條件也相對較差。","https://airtw.epa.gov.tw/images/indexHashtag/indexHashtag_19.jpg"]
}