{
    "阿富汗": "位於亞洲中南部的內陸國家，坐落在亞洲的心臟地區。因戰亂導致的經濟困難延續，是世界上最低度開發國家。",
    "奧蘭群島": "位於波羅的海、波的尼亞灣入口處的一個群島，也是芬蘭的一個自治區，通用瑞典語。",
    "阿爾巴尼亞": "是一個位於歐洲東南部，巴爾幹半島西南部的國家。",
    "阿爾及利亞": "是非洲北部阿拉伯馬格里布的一個國家，國土濱臨地中海，陸地面積居非洲國家之冠。",
    "美屬薩摩亞": "是在南太平洋的美國非合併非建制領土。最早自公元前1000年就有人定居，歐洲探險家在18世紀到達薩摩亞。",
    "安道爾": "也譯作安道拉親王國，中文通稱安道爾，為一袖珍國家，國土面積468平方公里。",
    "安哥拉": "為位於非洲西南部的國家，首都羅安達，西濱大西洋，北及東北鄰剛果民主共和國。",
    "安圭拉": "是英國十四個海外領土之一，位於小安地列斯群島北部，以伊麗莎白二世為元首。",
    "安地卡及巴布達": "是中美洲的一個島國，位於加勒比海和大西洋之間。",
    "阿根廷": "由23個省和布宜諾斯艾利斯自治市組成的聯邦共和國，位於南美洲南部。",
    "亞美尼亞": "是一個位於西亞或外高加索地區的共和制國家，有時也會被視為是東歐的一部分。",
    "阿魯巴": "是一個位於加勒比海地區的島嶼，目前是荷蘭王國四個構成國之一。",
    "澳大利亞": "是一個位於南半球中北部、東半球東部的議會制君主立憲制國家。",
    "奧地利": "是一個位於中歐的內陸國家，但在歷史上也被分類成西歐或者東歐的主權國家。",
    "阿塞拜疆": "是一個位於西亞外高加索東部的跨大陸的總統制、憲法共和制的國家，所處地區是連接東歐和西亞的十字路口。",
    "巴哈馬": "是位於大西洋西側廬卡雅群島上的一個島國，全國包含700座島嶼和珊瑚礁。",
    "巴林": "是一個位於西亞、鄰近波斯灣西岸的島國。",
    "孟加拉國": "該國98%的人口使用孟加拉語，國教為伊斯蘭教；信仰人口排名為伊斯蘭國家第三。",
    "巴貝多": "是位於加勒比海與大西洋邊界上的島國，是西印度群島最東端的島嶼，",
    "白俄羅斯": "是位於東歐的內陸國家，首都為明斯克。",
    "比利時": "為歐洲聯盟的創始會員國之一，首都布魯塞爾是歐盟與北大西洋公約組織等大型國際組織的總部所在地。",
    "貝里斯": "前身為英屬宏都拉斯，是中美洲東海岸的一個獨立國家。",
    "貝南": "是非洲西部國家，舊名達荷美。貝南南瀕幾內亞灣。",
    "百慕達": "法律文件中也作百慕達群島或薩默斯群島，位於北大西洋屬北美，是英國的自治海外領地。",
    "不丹": "清朝史籍稱布魯克巴，是位於中國和印度之間喜馬拉雅山脈東段南坡的一個南亞內陸國。",
    "玻利維亞": "是南美洲的一個內陸國家，為南美洲國家聯盟的成員國。",
    "波士尼亞與赫塞哥維納": "是歐洲南部巴爾幹半島西部的多山國家，首都塞拉耶佛。波赫為組成原南斯拉夫的六個社會主義共和國之一。",
    "波札那": "是位於非洲南部的內陸國，全國國境皆為乾燥的台地地形。",
    "巴西": "是拉丁美洲最大的國家。人口數略多於2億，居世界第五。",
    "英屬維京群島": "是英國海外領土，位於加勒比海地區，處於波多黎各以東。",
    "汶萊": "也作汶萊和平之國，簡稱汶萊或文萊，舊亦稱婆羅乃，是一個位於婆羅洲北岸的東南亞國家。",
    "保加利亞": "是位於歐洲東南部巴爾幹半島上的一個國家，東部濱臨黑海。",
    "布吉納法索": "布吉納法索為全球識字率最低的國家之一，只有約兩成三的國民識字。低度開發國家之一。",
    "緬甸": "是一個東南亞國家，位於中南半島西部，國土面積約67.65萬平方公里，是世界上第40大國家、東南亞第二大國。",
    "蒲隆地": "是一個位於東部非洲的小型內陸國家，其中與剛果民主共和國的邊界有超過一半是座落在著名的坦噶尼喀湖湖面上。",
    "柬埔寨": "位於東南亞中南半島，境內有湄公河和東南亞最大的淡水湖－洞里薩湖。",
    "喀麥隆": "是位於非洲中西部的單一制共和國。",
    "新喀里多尼亞": "是法國在大洋洲西南部的一個特別集體。該地區整體主要由新喀里多尼亞島和洛亞蒂群島組成。",
    "加拿大": "加拿大的領土面積達998萬4670平方公里，為全球面積第二大國家。加拿大素有「楓葉之國」的美譽，渥太華為該國首都。",
    "維德角": "是一個位於非洲西岸的大西洋島國。它橫跨大西洋中部的10個火山島，距離西非海岸線570公里。",
    "開曼群島": "是英國在美洲加勒比海西印度群島的一塊海外屬地，由大開曼、小開曼和開曼布拉克3個島嶼組成。開曼群島是世界第四大離岸金融中心，並是著名的潛水勝地。",
    "中非共和國": "位於中部非洲的國家，其前身為法屬烏班基-夏利領地，是法國位於非洲的殖民地之一。",
    "查德": "是非洲中部的一個內陸國家，由於地處非洲中心，遠離海洋，全年高溫炎熱，且國土大部為沙漠地區，又被稱「非洲死亡之心」。",
    "智利": "是位於南美洲的一個國家，西和南瀕太平洋，由於地處美洲大陸的最南端，與南極洲隔海相望，智利人常稱自己的國家為「天涯之國」。",
    "聖誕島": "是澳大利亞位於印度洋東北部的海外領地，為火山島，面積135平方公里。",
    "中國": "是位於東亞的社會主義國家，首都位於北京。被視為亞洲地區重要地域大國，也被視為當今潛在超級大國之一。",
    "哥倫比亞": "是南美洲西北部的一個國家，為南美洲國家聯盟的成員國。",
    "葛摩": "是非洲阿拉伯國家島國，位於印度洋莫三比克海峽北部，莫三比克和馬達加斯加之間。",
    "剛果民主共和國": "是位於非洲中部的國家，簡稱民主剛果、剛果。陸地面積約234.5萬平方公里，是非洲第2大、暨世界第11大的國家。",
    "剛果共和國": "簡稱剛果或剛果，是非洲中部的一個國家。首都為布拉薩市。",
    "庫克群島": "是一個位在南太平洋上，介於法屬玻里尼西亞與斐濟之間，由15個島嶼組成的群島，其命名起源於遠征探索南太平洋，發現了許多島嶼的詹姆斯·庫克船長。",
    "象牙海岸": "是位於西非的國家在冷戰時期曾是最繁盛的西非熱帶國家之一，但1985年後因政治腐敗及缺乏改革致使經濟一蹶不振。",
    "哥斯大黎加": "哥斯大黎加是當今世界上第一個裁撤軍隊的國家。哥斯大黎加首都在聖荷西。",
    "科科斯群島": "是澳洲位於印度洋的海外領地，位於澳大利亞本土與印尼之間。",
    "克羅埃西亞": "是一個位於中歐、地中海和巴爾幹半島交會處的單一議會共和制國家，首都為札格瑞布。",
    "庫拉索": "原為荷屬安地列斯群島的一部分，2010年10月10日後改制為荷蘭王國的構成國。",
    "古巴": "是美洲加勒比海北部的一個群島國家。",
    "賽普勒斯": "是位於歐洲與亞洲之間的一個島國，位於地中海東部，面積9,251平方公里。 ",
    "捷克": "是一個位在於中歐的內陸國家，但在歷史上也被分類成西歐或者東歐的國家。",
    "丹麥": "是一個丹麥本土、法羅群島和格陵蘭三者的合稱，三者依照「王國邦聯」的原則組成統一的君主立憲制的國家。",
    "吉布提": "位於非洲東北部亞丁灣西岸的國家，位在亞丁灣與紅海交界處。戰略位置十分重要。",
    "多明尼克": "是一個位於中美洲加勒比海的島國，西印度群島之一，首都為羅索。",
    "多明尼加": "是位於加勒比海的島國，首都與最大都市為聖多明哥。",
    "東帝汶": "是位於東南亞地區帝汶島東端的國家，曾是葡萄牙在遠東僅有的兩個殖民地之一。",
    "厄瓜多": "是一個位於南美洲西北部的國家，於1809年8月10日時脫離西班牙的統治獨立建國。",
    "埃及": "是東北非洲人口最多的國家，該國大部分國土位於北非地區。伊斯蘭教為國教。",
    "薩爾瓦多": "是位於中美洲北部國家，為中美洲唯一不靠大西洋之國家，首都為聖薩爾瓦多。",
    "赤道幾內亞": "是中非西部的國家之一，雖然國名中帶有赤道字樣，但赤道只通過國土之間的海域，並未直接穿過該國領土。",
    "厄利垂亞": "是位於非洲東北部的國家，瀕臨紅海，面積12.5萬平方公里，人口約650萬人，首都為阿斯瑪拉。",
    "英格蘭": "是大不列顛及北愛爾蘭聯合王國的一個構成國，英國面積最大，人口最多，經濟最發達的一個部分。",
    "愛沙尼亞": "位於歐洲東北部，其國土由大陸部分和波羅的海的2222個島嶼組成。",
    "歐盟": "是根據1993年生效的《馬斯垂克條約》所建立的政治經濟聯盟，現擁有28個成員國。",
    "衣索比亞": "是全球人口最多的內陸國家，以及繼奈及利亞以後，人口最多的非洲國家，有超過1億居民。",
    "法羅群島": "是丹麥王國的自治領地，但不是歐盟的一部分。",
    "斐濟": "位於南太平洋，國家名稱是源自東加語中的「島嶼」，並且轉為斐濟文中的「Viti」。",
    "芬蘭": "是北歐國家，是世界高度的已開發國家和福利國家，國民享有極高標準的生活品質。",
    "聖赫倫那": "是大西洋島嶼，主權屬於英國，離非洲西岸1900公里，",
    "法國": "是本土位於西歐並具有海外大區及領地的主權國家，首都為歐洲大陸最大的文化與金融中心巴黎。",
    "法屬圭亞那": "是法國的一個海外大區和單一領土集體，下轄一個海外省，即圭亞那省。",
    "法屬波利尼西亞": "是法國在南太平洋的海外集體和自治國，由幾組玻里尼西亞群島組成。",
    "加彭": "是位於非洲中西部的一個國家。首都和最大城市是利伯維爾。",
    "甘比亞": "是位於西非的國家，陸上被塞內加爾環繞，是非洲大陸最小的國家。",
    "喬治亞": "是一個位於西亞外高加索西南隅的歐亞邊界國家。它曾經是蘇聯加盟共和國，1991年4月9日正式獨立。",
    "德國": "是位於中西歐的聯邦議會共和制國家，由16個邦組成，首都與最大城市為柏林。",
    "迦納": "是非洲西部的國家，首都阿克拉。",
    "直布羅陀": "是14個英國海外領土之一，也是最小的一個，位於伊比利亞半島的末端，是通往地中海的入口。 ",
    "希臘": "是位於歐洲東南部的跨大洲國家。雅典為希臘首都及最大城市，塞薩洛尼基為第二大城市。",
    "格陵蘭": "是世界第一大島，在丹麥王國框架內的自治國。",
    "格瑞那達": "是美洲西印度群島中向風群島南部國家。主要宗教為天主教，大英國協成員國。",
    "瓜地洛普": "群島位於小安的列斯群島中部、東加勒比海上。是法國26個大區中的一員和法蘭西共和國整體的一部分。",
    "關島": "為美國的非合併建制屬地，位於西太平洋的島嶼。",
    "瓜地馬拉": "位於中美洲，境內有數個湖泊，其中最大湖泊為伊薩瓦爾湖。",
    "根息": "是英國的皇家屬地之一，位於英吉利海峽靠近法國海岸線的海峽群島之中。",
    "幾內亞": "是位於西非的國家，國名源於柏柏爾語，意思是「黑人的國家」。",
    "幾內亞比索": "是在北大西洋岸的西非國家，曾為葡屬幾內亞。是世界上最低度開發國家之一。",
    "圭亞那": "位於南美洲北部，是南美洲唯一以英語為官方語言的國家，也是大英國協成員國。",
    "海地": "位於加勒比海的島國。是美洲唯一以黑人為主體民族的共和國。",
    "宏都拉斯": "中美洲共和制國家，首都德古西加巴。",
    "香港": "位於中國東南方，早期為英國的殖民地。是全球金融重鎮與主要港口。",
    "匈牙利": "位於中歐的內陸國家，首都為布達佩斯。",
    "冰島": "北大西洋中的一個島國，位於北大西洋和北冰洋的交匯處，通常被視為北歐五國之一。",
    "印度": "是位於南亞印度次大陸上的國家，印度面積位列世界第七，印度人口眾多，位列世界第二。",
    "印度尼西亞": "由17,508個島嶼組成，是世界上最大的群島國家，疆域橫跨亞洲及大洋洲，別稱「萬島之國」。",
    "伊朗": "位於西亞，為中東國家，501年之前很長一段歷史時間稱波斯。",
    "伊拉克": "位於西亞—中東地區的共和國，在歷史上曾被稱為美索不達米亞，是人類文明的主要發源地之一。",
    "愛爾蘭": "是一個西歐國家，歐盟成員國之一，位於歐洲大陸西北海岸外的愛爾蘭島，約占該島南部的5/6面積。",
    "曼島": "位於英格蘭與愛爾蘭之間的海上島嶼，曼島是英國皇家屬地，嚴格來說在法律上並不是英國的一部分。",
    "以色列": "是位於西亞的主權國家，其領土範圍不大，但地形和氣候相當多樣。",
    "義大利": "是一個歐洲主權國家，主要由位於南歐的靴型亞平寧半島及兩個地中海島嶼西西里島和撒丁島所組成。",
    "牙買加": "是加勒比海地區的一個島國。原本是印第安人阿拉瓦克語系泰諾族的居住地。",
    "日本": "是位於東亞的島嶼國家，當中逾3,500萬人居住於首都東京及周邊數縣構成的首都圈，為世界最大的都市圈。",
    "澤西島": "是英國王冠屬地，位於諾曼地半島外海20公里處的海面上。",
    "約旦": "是位於西亞的中東的國家。",
    "哈薩克": "為跨洲國家，地跨歐亞兩洲，為世界上最大的內陸國家，世界第九大國。",
    "肯亞": "位於東非，瀕臨印度洋，首都為奈洛比。肯亞曾是英國殖民地，1963年12月12日從英國獨立。",
    "吉里巴斯": "是位於太平洋上的島嶼國家，國名源自於該國三大群島當中最大的吉爾伯特群島之密克羅尼西亞語音譯。",
    "北韓": "是位於東亞朝鮮半島北部的共和國，於第二次世界大戰後的1948年9月9日成立。",
    "南韓": "是位於東亞朝鮮半島南部的民主共和國，首都為首爾。",
    "科沃索": "是一個主權爭端地區及有限承認國家，位於歐洲東南部巴爾幹半島。",
    "科威特": "是位於西亞阿拉伯半島東北部、波斯灣西北岸的君主制國家。該國首都科威特城與該國名稱同名。",
    "吉爾吉斯": "是一個位於中亞的內陸國家。作為中亞古國，吉爾吉斯歷史達兩千年，經歷各種王朝與文化。",
    "寮國": "是東南亞國家中唯一的內陸國家。",
    "拉脫維亞": "是位於波羅的海東岸的歐洲國家，是波羅的海國家之一。",
    "黎巴嫩": "是位於亞洲西南部、地中海東岸，習慣上稱為中東國家。",
    "賴索托": "位處非洲南部，是全世界最大國中國，全境完全被南非共和國包圍，因地處高原，賴索托也被稱為「天空王國」。",
    "賴比瑞亞": "位於西非，西南瀕大西洋的總統制共和國家。",
    "利比亞": "是北非的一個阿拉伯國家。",
    "列支敦士登": "歐洲中部的內陸小國，夾在瑞士與奧地利兩國間，為世界上僅有的兩個雙重內陸國之一。",
    "立陶宛": "位於歐洲東北部，是波羅的海三國之一，首都維爾紐斯。",
    "盧森堡": "是一個位於歐洲的內陸國家，也是現今歐洲大陸僅存的大公國，首都盧森堡市。",
    "荷屬聖馬丁": "為荷蘭王國的4個構成國之一，首府菲利普斯堡。",
    "澳門": "是中國兩個特別行政區之一，重要產業為旅遊業與博彩業。為世界上人口密度最高的地區，每平方公里人口超過2萬。",
    "馬其頓": "是位於東南歐的巴爾幹半島南部的內陸國家，首都與最大都市是史高比耶。",
    "馬達加斯加": "是一個位於非洲東南部近海的印度洋島嶼國家。",
    "馬拉威": "是一個位於非洲東南部的內陸國家，首都利隆圭位於馬拉威的中部。",
    "馬來西亞": "位於東南亞的國家，實行聯邦制、議會民主制、選舉君主制和君主立憲制國家，",
    "馬爾地夫": "位於斯里蘭卡及印度西南偏南對出的印度洋水域約500公里處",
    "馬利": "是位於西非的內陸國家，西非面積第二大的國家。它的北部邊界在撒哈拉沙漠的中心，大多數人集中在南部，尼日河和塞內加爾河源於這裡。",
    "馬爾他": "位於南歐的共和制的一個微型國家，首都法勒他。",
    "馬紹爾群島": "是位於北太平洋的島嶼國家。馬紹爾群島是密克羅尼西亞群島的一部分。",
    "馬丁尼克": "是法國的一個海外大區。下轄一個省，即馬丁尼克省。面積1,130平方公里，首府法蘭西堡。",
    "毛里塔尼亞": "是西非阿拉伯國家之一。",
    "模里西斯": "位於印度洋的西南方，距非洲大陸2,200公里。",
    "馬約特島": "是法國的海外大區，下轄一個省，即馬約特省。",
    "墨西哥": "是中美洲的一個聯邦共和制主權國家，為世界第十人口大國與西班牙語世界第一人口大國。",
    "密克羅尼西亞": "是一個西太平洋島國，屬於加羅林群島，全國有607個島嶼。",
    "摩爾多瓦": "是位於東歐的內陸國家，首都是基西紐。",
    "摩納哥": "是一個位於歐洲的城邦國家。主要由摩納哥舊城和隨後建立起來的週遭地區組成。",
    "蒙古": "是一個東亞的單一半總統制共和國，首都與最大城市為烏蘭巴托。",
    "蒙哲臘": "是英國海外領土，為西印度群島中背風群島南部的火山島。",
    "蒙特內哥羅": "是位於巴爾幹半島西南部、亞得里亞海東岸上的一個多山國家。",
    "摩洛哥": "是北非西端的一個君主立憲制國家。",
    "莫三比克": "位於非洲南部，臨印度洋，隔莫三比克海峽與馬達加斯加相望。",
    "納米比亞": "是位於南部非洲西面的共和國。",
    "諾魯": "是位於南太平洋密克羅尼西亞群島的島國。亦是世界上最小的島國，",
    "尼泊爾": "是南亞喜馬拉雅山脈地區的一個內陸國家，世界上最高的十座山峰中有八座位於尼泊爾境內。",
    "荷蘭": "直譯低地之國，是主權國家荷蘭王國下的主要構成國。",
    "荷屬安地列斯": "位於加勒比海之中，原稱荷屬西印度。",
    "紐西蘭": "是主權島國紐西蘭王國的主要領域，首都為威靈頓，但最大的城市為奧克蘭都會區。",
    "尼加拉瓜": "是位於中美洲的一個國家，為中美地峽面積最大的國家。",
    "尼日": "是西非內陸國家之一，因尼日河得名，首都尼阿美。",
    "奈及利亞": "是西非國家，位於非洲的幾內亞灣西岸頂點。",
    "紐埃": "是位於太平洋中南部島國，國土爲一橢圓形島嶼以及周圍的珊瑚礁環繞組成，面積260平方公里。",
    "北馬里亞納群島": "是美國的一個自由邦，位於西太平洋上的戰略要地。",
    "挪威": "位於斯堪地那維亞半島的西部，東與瑞典接壤。",
    "巴勒斯坦": "是一個由居住在西亞－巴勒斯坦地區的約旦河西岸以及加薩走廊的阿拉伯人所建立的國家。",
    "阿曼": "是位於西南亞，阿拉伯半島東南沿海的國家。在上古時代稱作「馬乾」。",
    "巴基斯坦": "位於南亞，是大英國協成員國。",
    "帛琉": "位於西太平洋的島嶼國家。全國有約340座島嶼。",
    "巴拿馬": "是中美洲最南部的國家，連接大西洋及太平洋的巴拿馬運河位於國家的中央，擁有重要的戰略與經濟地位。",
    "巴布亞紐幾內亞": "是位於太平洋西南部的一個島嶼國家。",
    "巴拉圭": "是南美洲內陸國家，國名在西班牙語中是「鸚鵡」的意思。",
    "秘魯": "是南美洲西部一個實行總統制議會的民主共和國，官方語言是西班牙語。",
    "菲律賓": "是位於東南亞的一個群島國家。",
    "波蘭": "位於中歐的民主共和國。絕大部分地區位於東歐平原，首都是華沙。",
    "聖皮埃與密克隆群島": "是法國的一個海外屬地之一，亦是歐盟的一部分，",
    "法屬玻里尼西亞": "是法國在南太平洋的海外集體和自治國，由幾組玻里尼西亞群島組成。",
    "葡萄牙": "是西南歐伊比利亞半島上的共和國，實行單一制和半總統制，首都為里斯本。",
    "波多黎各": "是美國在加勒比海地區的一個自治邦，在西班牙語裡波多黎各的意思是「富裕海港」。",
    "卡達": "是位於西亞的君主專制國，屬於遜尼派的阿拉伯國家。",
    "留尼旺": "是一座印度洋西部馬斯克林群島中的火山島。為法國的海外大區之一。",
    "羅馬尼亞": "位於歐洲東部的一個雙首長制議會國家，多瑙河幾乎佔了南邊與保加利亞之間的國界大半。",
    "俄羅斯": "是位於歐亞大陸北部的聯邦共和國，國土橫跨歐亞兩大洲，為世界上土地面積最大的國家。",
    "盧安達": "是位於中非東部的主權國家。",
    "聖克里斯多福及尼維斯": "是一個由聖克里斯多福島和尼維斯島組成的聯邦制島國，位於中美洲加勒比海地區。",
    "聖盧西亞": "是東加勒比海鄰近大西洋的島國。",
    "聖文森及格瑞那丁": "是拉丁美洲的一個國家，位於加勒比海的小安的列斯群島中的向風群島南部。",
    "薩摩亞": "是一個南太平洋島國，約位於夏威夷與紐西蘭的中間。",
    "聖馬利諾": "位於義大利半島的亞平寧山脈東北側，處於被義大利包圍的國中國狀態。",
    "聖多美和普林西比": "位於中非西部的幾內亞灣，面積1001平方公里。",
    "沙烏地阿拉伯": "是一個位於西亞阿拉伯半島的阿拉伯人國家。在阿拉伯世界中地理面積第二大的國家。",
    "蘇格蘭": "是大不列顛及北愛爾蘭聯合王國下屬的構成國之一，位於大不列顛島北部。",
    "塞內加爾": "西非國家，位於塞內加爾河的南岸，首都達卡。",
    "塞爾維亞": "是一個巴爾幹半島的國家，位於歐洲東南部，巴爾幹半島中部的內陸國。",
    "塞席爾": "是位於南非東部，印度洋中西部一個群島國家。為大英國協成員國。",
    "獅子山": "位於西非大西洋岸，首都自由城。",
    "新加坡": "是東南亞馬來半島南端的一個城市國家，扼守馬六甲海峽最南端出口，是全球最國際化的國家之一。",
    "斯洛伐克": "是中歐的一個內陸國家，實行議會民主制。",
    "斯洛維尼亞": "是一個位於中歐的，毗鄰阿爾卑斯山的小國。",
    "所羅門群島": "是南太平洋的一個島國，是大英國協成員之一。",
    "索馬利亞": "位於索馬利亞半島上的一個東非國家。",
    "南蘇丹": "是非洲東北部一個內陸國家，2011年從蘇丹獨立。",
    "南非": "是位於非洲南端、南大西洋和南印度洋交會處的共和國。",
    "西班牙": "是位於歐洲西南部的君主立憲國家，與葡萄牙同處於伊比利半島。",
    "斯里蘭卡": "是一個位於南亞－印度次大陸東南方外海的島國，屬於亞洲。",
    "蘇丹": "爲非洲面積第三大國、世界面積第16大國。首都喀土穆。",
    "蘇利南": "位於南美洲北部，1954年成為荷蘭王國海外自治省，1975年時獨立。",
    "史瓦帝尼": "是非洲南部的一個內陸國家，北、西、南三面為南非共和國所包圍。",
    "瑞典": "是一個位於斯堪地納維亞半島的北歐國家，首都為斯德哥爾摩。",
    "瑞士": "為聯邦制國家，為紅十字國際委員會的發源地且為許多國際性組織總部所在地，如聯合國日內瓦辦事處。",
    "敘利亞": "位於西亞，地中海東岸，屬於中東阿拉伯國家。",
    "台灣": "是位於東亞、太平洋西北側，存在主權爭議的共和制國家。",
    "塔吉克": "中亞國家之一，在中亞國家之中國土面積最小。",
    "坦尚尼亞": "是位於赤道以南的東非國家，首都為杜篤瑪。",
    "泰國": "是東南亞的君主立憲制國家，首都及最大城市為曼谷。",
    "托克勞": "是位於南太平洋一個紐西蘭屬地，由三個珊瑚島環礁組成。",
    "多哥": "西非國家之一，首都及最大城市為洛美。",
    "東加": "是一個位於太平洋西南部由172個大小不等的島嶼組成島嶼國家。",
    "千里達及托巴哥": "位於中美洲加勒比海南部、緊鄰委內瑞拉外海的島國。",
    "突尼西亞": "位於北非、隸屬於馬格里布地區。",
    "土耳其": "是一個橫跨歐亞兩洲的國家。",
    "土庫曼": "是一個中亞國家。",
    "土克斯及開科斯群島": "位於中美洲巴哈馬群島東南的英國屬地，屬西印度群島內盧卡亞群島的一部份。",
    "圖瓦盧": "由九個環形珊瑚島群組成的島國，位於南太平洋。",
    "烏干達": "位於東非的內陸國家，為伊斯蘭會議組織成員。",
    "烏克蘭": "是歐洲面積第二大的國家，僅次於俄羅斯。",
    "阿拉伯聯合大公國": "由阿布達比、夏爾迦、杜拜、阿吉曼、富吉拉、歐姆古溫、哈伊馬角七個酋長國組成的邦聯制君主國。",
    "英國": "是本土位於西歐並具有海外領地的主權國家。",
    "美國": "是由其下轄50個州、華盛頓哥倫比亞特區、五個自治領土及外島共同組成的聯邦共和國。",
    "烏拉圭": "南美洲東南部國家，近180萬居於其首都和最大城市蒙特維多及其都市區。",
    "烏茲別克": "，是一個位於中亞的內陸國家，1991年從原蘇聯獨立。是世上兩個雙重內陸國之一。",
    "萬那杜": "是位於太平洋西南部，於1980年獨立建國，由80多個島嶼組成。",
    "梵蒂岡": "是位於義大利首都羅馬西北角高地的內陸城邦國家，為天主教會最高權力機構聖座的所在地。",
    "委內瑞拉": "是一個位於南美洲北部的熱帶國家，為南美洲國家聯盟的成員國。首都為卡拉卡斯。",
    "越南": "是位於東南亞的印度支那半島東端的社會主義國家，實行一黨制。",
    "瓦利斯和富圖納群島": "於斐濟和薩摩亞群島之間，首府馬塔烏圖。",
    "威爾斯": "位於大不列顛島西南部，為大不列顛與北愛爾蘭聯合王國構成國之一。",
    "葉門": "為西南亞國家，阿拉伯海和紅海邊緣，首都為沙那。",
    "贊比亞": "是中非的一個內陸國家。",
    "津巴布韋": "是位於非洲南部的內陸國家，最大城市和首都為哈拉雷。",
    "聯合國": "是一個由主權國家組成的政府間國際組織，致力於促進各國在實現持久世界和平方面的合作。",
    "魁北克": "是加拿大一個高度自治的省份，官方語言為法語，北美的法語人口主要集中在此。",
    "北賽普勒斯": "是一個位於西亞賽普勒斯島北部、地中海東部，屬於未受到國際承認的國家。在國際法上被認為是傀儡國家。",
    "聶斯特河沿岸": "1990年從摩爾多瓦獨立並引發內戰。在摩爾多瓦官方編制的行政區劃中是「具有特殊法律地位的聶斯特河沿岸自治領土單位」。",
    "阿布哈茲": "位於西亞高加索山附近，是一個備受爭議而事實上獨立的政治實體，但只被極少數國家承認。",
    "北愛爾蘭": "是英國的政治實體之一，位於愛爾蘭島東北部。此為過去曾使用的「紅手旗」，目前沒有正式的官方旗幟。",
    "索馬利蘭": "位於非洲之角，一個事實上獨立的共和國，曾受英國殖民統治，但未曾獲其他國家和國際組織承認。",
    "頓內次克人民共和國": "由烏克蘭東部與親俄武裝分子在攻佔當地的行政大樓後宣布成立的國家。但沒有得到國際社會普遍承認。",
    "盧干斯克人民共和國": "是盧干斯克州的親俄武裝分子於2014年4月27日攻占當地安全部門大樓後宣布成立的獨立國家，但沒有得到國際社會普遍承認。",
    "阿爾札赫": "是外高加索地區的一個共和國，聯合國和世界上的大部分國家均將其視為亞塞拜然的一部分。",
    "南奧塞提亞": "是位於西亞南高加索的一個未受國際普遍承認國家，首都茲辛瓦利。",
    "西撒拉威": "是一個位於北非西撒拉威地區的阿拉伯國家。聲稱擁有整個西撒拉威地區的主權，但目前只能控制有關領土的20%。",
    "馬爾他騎士團": "前身為十字軍東征之後成立之軍事組織，其主權地位受到爭論。現在以宗教慈善醫療組織的形式運作，為全球最小的政治實體。",
    "美屬維京群島": "是美國在加勒比海的一個建制非合併屬地群島，在地理方面，屬於維京群島的一部份。",
    "諾福克島": "是澳洲的一個島嶼，隸屬於新南威爾斯省。",
    "休達": "是西班牙兩個海外自治市之一，位於馬格里布的最北部，直布羅陀海峽附近的地中海沿岸，與摩洛哥接壤。面積約18.5km²。",
    "梅利利亞": "是西班牙兩個自治市之一，為西班牙位於北非的海外屬地，它位於地中海沿岸和馬格里布的最北部。",
    "華盛頓哥倫比亞特區": "是美國的首都，也是世界銀行、國際貨幣基金、美洲國家組織等國際組織總部的所在地，並擁有為數眾的博物館與文化史蹟。"
}