'use strict';
// Import the Dialogflow module from the Actions on Google client library.
const { dialogflow,Suggestions,SimpleResponse,Carousel, Button,Image, BasicCard, Table} = require('actions-on-google');

var admin = require('firebase-admin');
const {WebhookClient} = require('dialogflow-fulfillment');
const replaceString = require('replace-string');

const functions = require('firebase-functions');
const app = dialogflow({debug: true});
var dictionary=require('./rail_dictionary.json');
var sub_collcetion=require('./sub_collection.json');
var text_array=["鐵路","鐵道","鐵路網","鐵路法","鐵路營運機構","城際鐵路","幹線鐵路","都會區鐵路","郊區鐵路","國營鐵路","地方營鐵路(地方鐵路)","民營鐵路","公營鐵路","專用鐵路","標準軌鐵路","窄軌鐵路","雙軌距鐵路(複軌鐵路)","黏著式鐵路","非黏著式鐵路","電化鐵路","傳統鐵路","高速鐵路","大眾捷運系統","高架鐵路","地下鐵路","大眾運輸系統","膠輪式捷運系統","自動導引運輸糸統","單軌捷運系統","輕軌捷運系統","磁浮運輸系統","國際鐵路聯盟","接駁公車","接送轉乘","停車轉乘","一日生活圈","及門服務","電化率","複線率","複合運輸","永續運輸","國土開發計畫","新建工程","改線工程","增建工程","改建工程(改善工程)","選線(路線規劃)","可行性研究","綜合規劃","基本設計","細部設計","土地徵收","用地取得","機電工程","臨時工程","臨時軌(便線)","轉乘設施","接駁運具","通用設計","無障礙環境","無縫運輸","營運設施","特許經營","民間興建經營權移轉","軌道切換","聯合檢查","靜態測試","動態測試","試運轉","履勘","車站專用區","站區開發","附屬事業","租稅增額融資","大眾運輸導向發展","營運","營業","營業線","幹線","支線","客運線","貨運線","客貨兩用線","通勤路線","環狀線","電化區間","非電化區間","通車","分段營運(局部通車)","營運起始日期","營業里程","營運服務時間","乘坐品質","服務範圍","座位配置","定員(正常容納量,乘客定額)","運輸能力","運輸效率","服務水準","承載率","列車準點","營運計畫","基本運輸計畫(列車服務計畫)","運量調查","需求預測","預測運量(預測交通量)","尖峰時間(客運繁忙時間,擁擠時間)","尖峰時間運量","站間運量","最大運量區間","旅客量(旅運量)","列車種別(車種)","列車行駛區間","列車單元(列車組)","列車頻率","列車密度(運輸密度)","設備計畫","車輛計畫","列車性能(車輛性能)","動力車","拖車 (無動力車輛)","列車重量","空車重量","行車計畫(運行計畫,列車運轉計畫)","牽引力","動輪周牽引力","牽引桿牽引力","特性牽引力","起動牽引力(起步牽引力)","黏著牽引力","有效牽引力","黏著係數","軸重","牽引重量","牽引定數","換算車數","特性曲線","段位曲線","馬達旋轉力(扭力)","轉數(牽引馬達轉數)","齒輪比(變速齒數比)","額定電流","限流值","列車阻力","出發阻力(起動阻力)","行駛阻力","空氣阻力","坡道阻力","曲線阻力(彎道阻力)","隧道阻力","加速阻力(加速度阻力)","緊軔(煞車)","常用緊軔","緊急緊軔","氣軔","緊軔效率(軔機效率)","軔率(制動率)","閘瓦","加速力","加速度(加速)","減速度(減速)","緊軔力(制軔力)","緊軔距離","空走距離","空走時間","運轉性能曲線","加速力曲線","牽引重量曲線(載重曲線)","軔機性能曲線","動力車/拖車比","空轉","撒砂","急衝度","曲線","最小曲線半徑","坡度","最陡坡度","運轉速度(行駛速度)","臨界運行速度","最高速度","均衡速度","容許速度","限制速度","平均速度","表定速度","高速度","提高速度","運轉曲線圖","最短運轉時分","基準運轉時分","最小運轉時隔","路線容量","列車組數","站間距離","列車排點(列車排班)","定期列車","臨時列車(加班車)","平行列車運行圖","規格化班表(定型化班表)","網狀運行班表","波動計畫","運用計畫","車輛編組運用(車輛運用)","乘務員運用","客車運用","站內軌道使用計畫","維修計畫","訓練計畫","在職訓練","規則","運輸量(運量)","通過人數","最大承載率","客座利用率","列車準點率","列車誤點","行車事故率","平均運距","延人公里","延座公里(客座公里)","列車公里","客車公里","車輛公里","延噸公里","標記噸數　","通過噸數","單線","複線","雙單線","雙複線","上行線","下行線","正常運轉方向","站外行車路線","隔地法","隔時法","閉塞","閉塞區間","固定閉塞式","移動閉塞式","常用閉塞方式","自動閉塞式","中央控制行車制","車載號誌閉塞式","簡易聯動閉塞式","非自動閉塞式(人工閉塞制)","電氣路牌閉塞式","列車自動停車裝置","列車自動保護裝置","列車自動控制裝置","代用閉塞方式","通信閉塞式","嚮導式","指令式","嚮導通信式","傳令法","嚮導隔時法","列車運轉","單機運轉","單線運轉","複線運轉","短程運轉","長程運轉(長途行駛)","短途來回運轉(往復運轉)","回轉","直達運轉","方向別運轉","路線別運轉","等時隔運轉","重連總控制運轉","號誌運轉","無閉塞運轉","引導運轉","動力運轉","惰力運轉(惰行運轉)","推拉式運轉","推進運轉","退行運轉","逆向運轉","雙向運轉","慢行運轉","車場內運轉","站內運轉作業","單人運轉","無人運轉","迂迴運輸","行車區間","行車方向","行車相反方向(運轉方向之逆向)","行車時間","旅行時間","停車時間(停站時間)","班距","列車時間間隔","列車空間間隔","列車班次數","列車車次","列車運行圖","時刻表(行車時刻表)","表定時間(預定時間)","列車運行圖調整","改點","準點運轉(準時運轉)","站長","站務員","列車長","列車乘務員","客車等級","手(桿)軔機","同步控制線","車間通道","先開列車(先行列車)","續行列車(次班列車 ,續開列車)","對向列車","迴送車","乘車月台(開車月台)","開車時間","待避其他列車","待避列車","等候清道","不同月台轉乘","同一月台轉乘","轉乘(改乘,中轉,換乘)","列車轉換區","步行接駁","無縫隙轉乘","運行管理(行車管理)","綜合調度所(行車控制中心)","列車群控制","行車命令(調度指令)","調度員(控制員)","停車指令","臨時停車","運轉整理","制軔失宜(冒進)","衝突進路","回送列車再利用","應變計畫","列車延誤(遲延)","截短運轉","停駛","滑走","區域計畫","都市計畫","主要計畫","細部計畫","都市計畫事業","優先發展區","新市區建設","舊市區更新","通盤檢討","都市設計","土地使用分區管制","土地使用計畫","徵收","徵收補償","區段徵收","建築用地","建築容積管制","建築配置","建築執照","建築密度","建築設備","建築線","簷高","地下層","閣樓","居室","建築物","供公眾使用之建築物","公有建築物","雜項工作物","建築物之主要構造","建造","新建","增建","改建","修建","法定空地","建築物起造人","建築物設計人","建築物監造人","建築物承造人","專任工程人員","建造執照","雜項執照","使用執照","拆除執照","都市更新","都市更新事業","更新單元","實施者","權利變換","重建","整建","維護","類似通路","私設通路","永久性空地","幢","棟","一宗土地","路線","車站","號誌站","客運站(旅客站)","貨運站","端末式車站","通過式車站","待避站","中間站","交叉站","分歧站","交會站","中轉站","旅次起始站(起點站)","始發站","旅次到達站(終點站)","簡易站","託運站","招呼站","編組站","地面車站","地下車站","臨時站","站房","車站大樓","後站","站務室","穿堂層","候車大廳","候車室(候車區)","販賣部","旅客服務中心(服務台、詢問處)","旅客資訊顯示系統","售票區","自動售票機","儲值卡","儲值卡讀取系統","自動驗票閘門","剪票口","非付費區","付費區","旅客天橋","月台","中轉月台","月台雨棚","全罩式雨棚","月台緊急停車裝置","月台監視器","月台門","月台柵欄","站內平交道","導盲磚","自由通道","斜坡道","樓梯","照明設備","監視系統","出口","站前廣場","站內","站外","島式月台","側式月台(岸壁式月台)","單側月台","端末月台","梳形月台(鋸齒形月台)","正線","出發線","到達線","到開線","通過線","待避線","折返線","錯車軌","側線","袋狀軌(中央避車線)","橫渡線","止衝檔線","三角線","專用側線","安全側線","止衝檔","平交道","平面交叉","立體交叉","車輛基地(車場)","客車調車場(客車場)","貨車調車場(貨車場)","單式調車場","複式調車場","貫通式調車場","偏側式調車場(偏面式調車場)","環抱式調車場(大肚型調車場)","平面調車場","駝峰調車場","重力調車場","機務段","機廠","維修基地","檢車段","儲車","調車","聯掛","摘解","溜放(溜放調車)","方向別分類","列車編組","止輪器","止車楔(阻輪器)","脫軌器","復軌器","轉車盤","遷車台","檢車庫","檢修坑","調車場內軌道","路線配置(軌道配置)","線群","停留線群(儲車線群)","整備線群","檢修線群","梯形線","進出庫線(進出場線)","存車線(停留線)","重編線","備用車停留線","編組線","分類線","站別分類線","方向別分類線","守車線","轉換軌","裝卸線","倉庫線","拖上線(調車線)","機待線","機迴線","洗車線","檢修線","檢車線","廠內試車線","備用車輛","平均故障時間(故障頻率)","基地地面","專用區","建築基地","建築基地面積","建築界線","建築面積","容積率","建蔽率","總樓地板面積","樓地板面積","建築物昇降設備","公共設施用地多目標使用","廣場","鐵道文化資產","通廊","開放空間","人行道","高架車站","疊式月台","公共區","非公共區","月台層","夜間安全等候區","月台聯絡通道","出入口","緊急逃生梯","通風井","雨庇","無障礙電梯","樓梯平台","無障礙坡道","安全走道","月台末端門","扶手","柵欄","護欄","車道","國民生產毛額","國民所得","經濟成長率","直接成本","間接成本","建造成本","土地取得成本","損益計算表","客運收入(票箱收入)","運輸收入","營業收入(營運收入)","營業外收入(營運外收入)","營業係數(營業比率)","每公里營業收入","每人公里收入(每延人公里收入)","每噸公里收入(每延噸公里收入)","附屬事業收入","清算","運輸服務成本","營業成本","每公里營業支出","維修成本","資本支出","折舊(折舊費)","折舊準備","遞減折舊法","殘值","重置成本","財務效益","益本比","淨現值","自償率","內部報酬率(內生報酬率)","經濟效益","直接效益","淨效益","行車成本節省效益","旅行時間節省效益","肇事成本減少效益","時間價值","外部效益","經濟成本","貨幣化","社會效益","外部成本","成本效益","成本效益分析","折現率","資產負債表","資產","固定資產","長期負債","固定資產週轉率","固定資產淨值獲利率(固定資產報酬率)","流動資產","流動負債","流動比率","總資產週轉率","敏感度分析","現金流量","財源籌措","政府預算","民間投資","風險控管","風險控管計畫","工程計畫","工程接管","工程驗收","工地控制測量","干擾浮時(干擾寬裕時間)","加賬(減賬)","正式驗收","合約變更","合約價格","合約總價(訂約金額)","合理之近似値","自由浮時","先行圖示法","初驗","里程碑","作業所需時間","要徑","要徑法","施工日報","計畫評核術","浮時(寬裕時間)","追加工程","停工","規範","開工日","開工通知書","竣工","復工","單價","單價分析","最早開始時間","最早完成時間","最遲開始時間","最遲完成時間","資源有效分配","圖說","實質完工","節線圖示法","標定尺寸(重量)","實現價値分析","總浮時(總寬裕時間)","主鍵","正規化","資訊安全","存取權","存取時間","地理資訊系統","系統方法","相容性","記憶體","條碼","異動","通信","專家系統","軟體配置","軟體維護","軟體測試","結構化程式","結構化查詢語言","資料庫","資料項","資訊流程","資料流程圖","資料庫管理師","資料庫管理系統","視訊會議","電腦輔助設計","模組","綱目","管理資訊系統","檔案","應用軟體發展程序","共同管溝","地下水排水管","地面段","地面完成面","污水管","整地","推土機","挖溝機","排水溝","路基基層","路基底層","面層","瀝青透層","瀝青黏層","瀝青混凝土路面","集水井","人孔","鑄鐵蓋板","級配","排水","微細顆粒水泥灌漿","工地探查(工地調查)","夯實灌漿","地下水","地下水位","托底工程(基礎托換)","皂土","沉陷","泥漿","泥水","連續壁","潛盾機","潛盾施工法","導溝","特密管","鋼筋籠","超音波測試","監測系統","傾斜儀","水壓計","鋼筋計","水位觀測井","安全支撐","角托架","支撐壓力","土壓計","鑽掘機","高壓噴射灌漿","中間樁","橫板條","鋼板樁","施工構台","覆工鈑","油壓千斤頂","打擊式基樁","鑽掘式基樁","樁錘","樁帽","樁墊","地錨","岩錨","土釘工法","加勁土","土壤液化","地質改良","管湧","砂湧","地工織物","新奧工法","推管工法","管幕工法","全斷面隧道鑽掘工法","鑽炸工法","反循環樁","全套管基樁","預力鋼鍵地錨","斷層","正斷層","逆斷層","走向線","傾向","土石流","地滑","風化作用","岩石品質指標","承載力","抽水","降水","地下道","淨空(淨距)","鋼筋續接器","開挖","筏式基礎","明挖覆蓋法","逆打工法","鋼筋混凝土","預拌混凝土","高性能混凝土","自充填混凝土","初凝","終凝","混凝土流度","健度","水灰比","水膠比","伸縮縫","施工縫","止水帶","摻料","養護劑","冷縫","拌合廠","鋼筋","紮筋鐵絲","間隔器","保護層","搭接","箍筋","模板","清水模板","活動模板","模板支撐","鷹架","角鐵","高張力螺栓","組立","吊裝","焊接","斜撐","翼板","腹板","跨距","勁度","韌性","非破壞試驗","埋置長","懸臂工法","支撐先進工法","節塊推進工法","全跨預鑄吊裝工法","預鑄節塊工法","高架橋","胸牆","回填","不織布","防水","防水膜","建築物高度","屋頂突出物","地板面高度","樓層高度","天花板高度","建築物層數","夾層","外牆","承重牆","帷幕牆","不燃材料","耐火板","耐燃材料","防火時效","建築物設備","室內裝修","綠建材","磚構造","木構造","磚牆","空心磚牆","花崗石","大理石","石膏板","礦纖板","矽酸鈣板","輕隔間","露臺及陽臺","分間牆","阻熱性","防火構造","避難層","無窗戶居室","道路","遮煙性能","昇降機道","昇降機間","景觀工程","路線(鐵路路線)","路線平面圖","路線縱斷面圖","路線橫斷面圖","圓曲線起點","軌道","軌框","軌距","軌距線","靜態軌距","動態軌距","建築界限","動態包絡線","軌道中心距離","超高度","超高度之遞減","超高度不足量","加寬度","軌道不整","水平","方向","高低","動態不整","養路","路線封鎖","反向曲線","介曲線","豎曲線","路線標誌","版式軌道","鋼軌","定尺鋼軌","長焊鋼軌","長鋼軌","短鋼軌","防脫護軌","鋼軌踏面","異型鋼軌","緩衝軌","防脫角鐵","托接","懸接","扣件系統","鋼軌接頭","軌條接縫(軌縫)","對接式接頭","錯接式接頭","鋼軌伸縮接頭","魚尾板","魚尾螺栓及螺帽","異型魚尾板","絕緣接頭","夾膠(膠接)絕緣接頭","鉤頭道釘","軌道墊板","鋼軌防爬器","軌枕","木枕","預力混凝土枕","岔枕","軌撐","道床","無道碴道床","道碴道床","道碴厚度","底層道碴(補助道碴)","道碴","道碴墊","軌道版墊","水泥柏油砂漿","噴泥","鋼軌爬行","軌道挫屈","鋼軌磨耗","鋼軌損傷","砸道機","起道","降道","長焊鋼軌運輸車","轉轍拉桿","道碴橫向阻力","道碴縱向阻力","鋼軌舖定溫度","鋼軌軸向力","年通過噸數","道岔","菱形道岔","曲線道岔","剪形道岔","出軌道岔","特殊道岔","尖軌","岔心","主軌","基本軌","導軌","分岔角","道岔號數","入射角","分岔","道岔附帶曲線","道岔趾端","道岔踵端","背軌距","翼軌","鼻軌","護軌","對接","對向","背向","尖軌之密靠","外軌","軌道檢查車","鋼軌探傷車","三角高程測量","土地測量","工程測量","土方計算","大地測量","方向觀測法","方格北","方格坐標","方位角","中誤差","斷面中間樁","支距法","比例尺","天頂","天頂角(距)","水準儀","水準測量","電子雙軸水準氣泡","已知水準點","點之記","水平角","水準網","水準環線","平差","平行玻璃板","世界橫麥卡托投影","地形測量","地形圖","改正","定線測量","直接水準測量","河道測量","放樣","垂直角","施工測量","紅外線測距儀","高程","高程差","高程控制點","閉合差","細部測量","間接高程測量","路線測量","經緯儀","誤差","精度","縱斷面","縱斷面測量","斷面水準測量","全測站經緯儀","自動水準儀","電子水準儀","遙感測量","航空攝影測量","全球定位系統","光達測量","重力測量","電子地圖","數值高程模型","數值地形模型","獨立驗證與認證","驗證","可靠度","風險","拉勃朗克變壓器","史考特變壓器","中性區間","中性點接地","中點錨錠","主吊線","主電動隔離開關","交叉棒","吊掛線組件","架空地線","自動張力平衡裝置","自耦變壓器","伸縮接頭","吸流變壓器","架空線系統高度","遠端遙控系統(監控和資料擷取系統)","兩軌懸臂構造物","固定張力錨","沿線金屬接地","門型架","弛度(垂度)","電車線系統(架空懸垂線系統)","相位差","重疊區間","氣體絕緣開關","閃絡","偏位","偏移量","區分絕緣器","張力長度","接地","接地開關","接觸線","接觸線夾","桿距","單純懸垂式","短路試驗","溫度上升試驗","落臂架","跳線","電氣淨空","電桿","電磁干擾","電磁相容性","電蝕","熱劑焊接法","複合懸垂式","導電軌","諧波","鋼軌聯軌線","避雷器","雜散電流(洩漏電流)","雙接觸線夾","雙接觸線系統","雙槽結構柱","穩定臂","懸臂組","變電站","變壓器","平衡重錘錨錠裝置","主變電站","台電電表箱","台電電驛盤","動力變電站","比流器","比壓器","正線直流隔離開關","自動切換開關","布氏電驛","諧波濾波器","緊急跳脫裝置","交流復閉電驛","整流變壓器","整流器","直流引入盤","直流饋線盤","隔離開關","遙控終端單元","旁路隔離開關","短路裝置","直流動力接線盤","直流負迴流隔離開關","鐵路號誌保安裝置","視距","警衝標","定位(正位/反位)","進路式號誌機","號誌繼電器","號誌","顯示","表示","號誌機","號誌機外方","號誌機內方","主號誌機","進站號誌機","出發號誌機","閉塞號誌機","調車號誌機","從屬號誌機","進路表示器","臨時號誌機","慢行號誌機","慢行預告號誌機","慢行解除號誌機","二位式號誌機","三位式號誌機","色燈式號誌機","燈列式號誌機","臂木式號誌機","單燈式號誌機","車上號誌","自動號誌機","容許號誌機","絕對號誌機","平安定位號誌機","險阻定位號誌機","手作號誌","手作號誌代用器","號訊","標誌","閉塞號誌標誌","出發反應標誌","列車停車標誌","轉轍標誌","接近指示器","閉塞裝置","自動閉塞系統","路牌閉塞系統","轉轍器","單動轉轍器","雙動轉轍器","脫軌轉轍器","電動轉轍器","轉轍器電路控制器","轍查桿","鎖錠桿","尖端桿","軌距拉桿","尖軌之靠密","聯鎖裝置","第一種聯動裝置","第二種聯動裝置","鎖錠","聯鎖","機械聯動系統","繼電聯鎖系統","電子聯鎖系統","定位鎖錠","反位鎖錠","時間鎖錠","轍查鎖錠","進路鎖錠","進路分段鎖錠","接近鎖錠","保留鎖錠","平交道保安裝置","平交道警報機","平交道遮斷機","平交道列車接近裝置","平交道障礙物自動偵測裝置","軌道電路","有絕緣軌道電路","無絕緣軌道電路","直流軌道電路","音頻軌道電路","死區間","短路感度","鋼軌絕緣","阻抗器","號誌連軌線","回流軌連軌線","自動列車控制","自動列車駕駛","自動進路設定","計軸器","中央行車控制系統","列車自動防護系統","列車資訊系統","失效自趨安全","輪軸偵測器","地上感應器","編碼器","就地控制盤","聯鎖圖表","動作桿","應答器","阻抗搭接器","O3線圈","進路","進路授權","進路取消","進路解鎖","建議速度","目標速度","目標距離","列車碼","自動列車調整","自動列車監督","人機介面","跨接聯結器","列車跟隨","維生電路","維生電驛 (繼電器)","鐵路專用電話","半雙工器","全雙工機","多工機器","自動收費系統","系統整合測試","訊號噪音比","單向天線","無線電基地台","電/光轉換器及光/電轉換器","漏波電纜","諧波失真","光纖終端設備","同步數位階層","E1 多波道機組","中繼器","主電纜終端箱","鐵路電話電纜終端箱","電話總配線架","數位式電子交換機","交換式直流供電設備","列車資訊顯示系統","同步數位階層塞取多工機","數位多頻道中繼無線電系統","沿線電話","緊急電話","服務電話","光纖收容盤","同步光傳輸模式","空氣品質","機械式通風","煙塵","自然式通風","活塞效應","緊急運轉模式","臨界速度","正常運轉模式","塞車運轉模式","釋壓通風井","隧道風機","中央監視和控制系統","電力及照明監控子系統","環境管理監控子系統","安全管理監控子系統","火警監控子系統","雜項設備監控子系統","可程式控制器","數位輸入/輸出","類比輸入/輸出","脈衝訊號輸入","介面箱","輸入/輸出埠","數位光源處理系統","自動洗車設備","加柴油設施","軔機試驗設備","機油回收設備","壓縮空氣系統","車廂污物移取系統","架空起重機","同步抬高機","堆高機","電動平台搬運車","空調機清洗設備","濾網清洗設備","機車轉盤","轉向架轉盤","超音波探傷機","機油化驗設備","電池充放電機組","絕緣油過濾循環機","維修機具","物料架","搬運設備","地下式車輪車床","給水系統","排水系統","衛生設備","自動撒水系統","火警受信總機","消防栓箱","緊急廣播系統","排煙系統","消防連通管","氣體自動滅火設備","手提滅火器","泡沫滅火設備","連結送水管","防塵防水防護等級","低煙無毒電纜","用電需量","馬達控制中心","自動切換開關","自動功率因數調整器","緊急發電機","維生性負載","不斷電系統","消防泵浦","火警偵測系統","列車接近警示燈","離站指示燈及鈴","避難方向指示燈","出口標示燈","光源","電子式安定器","二線式集中控制系統","防火區劃","防煙區劃","火警探測器","共同天線系統","車站監控系統","緊急求救系統","電力系統接地端","弱電系統接地端","電話系統接地端","避雷系統接地端","等電位聯接","避雷保護","能源效率比值","外氣條件","防爆型風機","換氣次數","室內發熱量","外氣需求","冷卻水塔","冰水主機","冷氣機","中央冰水系統","空調箱","小型冷風機系統","排煙風門","排煙風機","負壓設計","一氧化碳偵測器","性能驗證","防火風門","防火填塞","直接數位控制","電梯","無機房式電梯","牽引式電梯","液壓式電梯","電扶梯","政府採購法","採購","工程","財物","勞務","廠商","上級機關","巨額採購","查核金額","公告金額","小額採購","監辦","非條約協定採購","外國廠商","公開招標","選擇性招標","限制性招標","專業服務","技術服務","資訊服務","統包","共同投標","公告","等標期","押標金","履約保證金","採購金額","銀行書面連帶保證","技術標審查","授權書","補充規定","預付款","招標文件","投標文件","投標須知","採購標的","書面密封","無廠商投標","無合格標","同等品","預估需用金額","預算金額","預計金額","公告日","邀標日","優良廠商","廠商申請釋疑期限","截標期限","未來增購","採購案號","機關答復期限","報價單","資源統計表","預算書","招標","領標","保證金","同業共同投標","異業共同投標","智慧財產權","招標公告","投標廠商","國際標準","國家標準","替代方案","設計競賽","開標日期","投標金額","底價金額","決標金額","標價","得標廠商","決標公告","開標","決標","決標日期","決標原則","異質採購","受理異議機關","申訴調解機關","契約","契約書主文","契約變更","契約價格","轉包","分包","履約期限","簽約日期","契約編號","共同供應契約","採購之文件","採購人員","主辦機關/業主","承包商","工程司","分包商","總價契約","關連契約","一般條款","技術規範","特訂條款","永久工程","部分工程","設備","施工設備","主要租賃設備","書面","竣工期限","限期完成","日曆天","工作天","契約工作項目","契約金額","契約單價","工程總表","詳細價目表","單價分析表","計量與計價","實作數量","一式計價","單價計價","按日計酬","保留款","公用設施","工地","工地作業","監工人員","供應材料","設計圖說","施工圖","工作圖","先行使用","作業","虛擬作業","次要徑","超前","落後","趕工計畫","工期展延","完工測試","提報竣工","逾期罰款","驗收","主驗人員","會驗人員","協驗人員","監驗人員","減價收受","結算驗收證明書","保固期","保固保證金","保固合格通知書","糾紛","調解","仲裁","訴訟","品質","要求","品質管理系統","品質手冊","品質政策","品質目標","品質改進","三級品管","施工查核","施工查核小組","施工執行資料表","自主評量表","五項指標","查核紀錄表","查核品質缺失扣點紀錄表","查核缺失改善情形報告","審查意見表","品質保證(品保)","品保管理","品保執行","品質管制(品管)","施工督導","施工督導小組","督導紀錄表","監造計畫","監造組織","自辦監造","委辦監造","施工計畫","品質計畫","品管費用","品管組織","品質管理人員","品管統計分析","標準作業程序","施工要領","施工管理","施工管理組織","施工日誌","契約圖說","停留點(限止點)","品質查證","抽驗","檢驗","全民督工","工程管理資訊系統","最高管理階層","品質程序","品質稽核","符合","不符合","持續改進","文件","紀錄","過程(流程)","追溯性","效果(有效性)","效率","審查","抽查","稽核","稽核計畫","稽核小組","稽查人員","受稽核者","稽核範圍","稽核方案","稽核準則","稽核證據","稽核發現","稽核結論","預防","預防措施","矯正","矯正措施","顧客滿意度","材料","請購","修理","製造","材料驗收","點收","儲存","調撥","領發","退料","退繳","拆收料","剩餘料","轉售","借贈","料價","料帳","材料稽查","呆料","廢料","粗細粒料","比重","小於75μm材料含量試驗","篩分析","氯離子含量","混凝土圓柱模製試體","抗壓強度","混凝土鑽心試體","土壤","含水量","工地密度試驗","夯實試驗","竹節鋼筋","不鏽鋼","低碳鋼","碳鋼","坍度試驗","降伏應力","極限強度","伸長率","細度模數","萬能試驗機","混凝土養護","混凝土抗彎試驗","金屬材料之彎曲試驗法","應力","應變","脆性","延性","光譜分析儀","標準砂","卜作嵐材料","孔隙比","夯實度","環境教育","環境","永續發展","生物廊道","生態工法","綠色內涵指標","開發行為","環境影響評估","開發單位","主管機關","水","地面水體","地下水體","污染物","水污染","生活環境","廢水","污水","廢(污)水處理設施","水污染防治措施","污水下水道系統","放流口","涵容能力","放流水","水區","水質標準","放流水標準","空氣污染物","污染源","排放標準","空氣品質標準","空氣污染防制區","自然保護(育)區","總量管制","總量管制區","最佳可行控制技術","噪音","振動","一般廢棄物","事業廢棄物","再生資源","回收再利用","再使用","再生利用","再生產品","輸送障礙(列車障礙,列車妨礙)","故障","車輛故障","機車故障","路線不通","路線故障","鐵路事故","行車事故","平交道事故","事故現場","追撞","進入錯線","溜逸","查道車溜逸","列車分離","列車碰撞","列車邊撞","正面衝撞(正面碰撞)","側面衝撞","傾覆","出軌(脫軌)","中途扳轉","電擊(觸電)","沿線火災","列車火災","天然災害","緊急應變","緊急搶修(緊急搶修復原)","列車旅客疏散","復舊(工程)","列車/車輛出軌","電車線故障","號誌故障","事件","事故","交通工程災害","甲級災害","乙級災害","丙級災害","應變知識","應變行為","災害認知","重大火災","爆炸","公用氣體與油料管線災害","輸電線路災害","勞工","雇主","職業災害","過負荷防止裝置","車輛系營建機械","乙炔熔接裝置","局限空間","就業場所","作業場所","工作場所","丁類危險性工作場所","危險性機械","容許下降速率","岩爆","避難指標","異常出水","落磐","隆起","湧水","寬軌鐵路","路面電車","輕軌電車","無障礙設施","無障礙設備","產業專用區","軸距","轉向架","輪緣","車軸","列車載重","換算噸數","運轉","單線簡易聯動閉塞式","物件導向程式設計","非同步式網頁開發技術","檔案傳輸協定","圖形化人機介面","超文件標記語言","超文件傳輸協定","區域網路","簡易資訊聚合","網際網路協定","虛擬私人網路","可延伸式標記語言","無線相容認證","外鍵","alpha 測試","beta 測試","資料表","欄位","資料紀錄","關聯式資料庫","索引","實體關係圖","程式碼","資料","指令","資料型態","變數","函式","標頭檔","程式區塊","迴圈","遞迴","條件判斷","廣域網路","間諜軟體","電腦病毒","木馬程式","釣魚網站","電腦蠕蟲","安全漏洞","零時差攻擊","僵屍網路","聯合開發","土地開發","二維條碼","計畫成本(總成本)","貨運收入","償債比率","工程建造費","吸水率","地下水污染","認證","系統保證","安全","車站變電站","饋電分電站","輔助饋電分電站","自耦變電站","斷路器","真空斷路器","回流線","保護線","第三軌","資料傳輸系統","無線電系統","有線電話系統","自動電話","直通電話","大眾廣播系統","子母鐘系統","閉路電視系統","行控中心","車輛系統","列車","動力集中式","動力分散式","機車","車輛","工作車","調車機車","傾斜式列車(搖擺式列車)","車輛界限","急衝率","蛇行運動","脫軌係數","車體","耐衝撞設計","機械式保護裝置","防爬器","踏面","軸箱","轉向架框","轉向架中心盤","懸承系統","空氣彈簧","抗搖擺減震器","排障器","牽引驅動系統","集電弓","離線","軔機","機械煞車","電力煞車","再生式煞車","渦電流煞車","磁力煞車","聯結裝置","聯結器","風擋","車內設備","車門設備","空氣調節裝置","無人保護裝置","消防系統","低壓配電系統","照明系統","環境管理系統","聯鎖閉塞制","國內生產總額","緊軔時間","閉塞準用法","收票口","旅遊服務中心","危機管理","風險管理","風險辨識","風險評估","風險預測","人為災害","天然人為災害","人為天然災害","走廊(行人通道)","哺集乳室","行包中心","車站大廳","室外通路","自行車補給站","止衝擋","自行車騎士休息區","半戶外空間","踏勘","順打工法","妥善率","維護度","故障樹分析","事件樹分析","失效模式、效應及關鍵性分析","危害","失效","失效報告、分析及改正措施系統","危害與可操作性分析","安全完整度等級","安全檔案","蒸汽機車","柴液機車","柴電機車","電力機車","綠色環境","綠色工法","綠色材料","綠色能源","綠建築標章","風險分析","風險評量","風險處理","風險接受","風險對策","風險規避","風險溝通","不確定性","危機","機會","危機處理","整合性風險管理","速度式號誌機","鬆軔","電軔","抓土機","自動平土機","滾壓機械","吊車","打樁機","拔樁器","混凝土拌合機","混凝土震動機","灌漿機","營運設備","列車駕駛(機車長)","副正線","整備月台","緊軔(煞車)模式","平面性","","","",""];
var result="";
var suggestion_array=[];
var i=0;
var response_array=["以下是詳細資訊","下面是我找到的對應條目","對應的條目如下","以下是您查閱的資訊","我找到的對應條目如下","對應條目如下顯示"];
var main_catagory=["總則篇","環保篇","機電篇","規劃篇","安全篇","工管篇","土建篇"];
var sub_catagory=["總則","一般環保事項","環境影響評估","水污染防治","空氣污染防制","噪音及振動污染防治","廢棄物污染防治","車輛","系統保證","電力","號誌","電訊","水環(一般機電)","廠區設備","綜合","經濟與財務效益","營運","運轉調度","用地","場站","管考","圖資","一般安全","營運安全","施工安全","採購","工程履約管理","品保管理","材料管理","材料試驗","工務","地工","結構","建築","軌道","測量"];


app.intent('預設歡迎語句', (conv) => {

	conv.ask(new SimpleResponse({ 
					speech: `<speak><p><s>歡迎，請試著輸入要查詢的詞彙或點擊建議卡片。我會為你提供來自交通部《鐵道辭典》的對應說明內容!</s></p></speak>`,
					text: '歡迎使用!'}));
	conv.ask(new BasicCard({
			title:'您可以開始進行查詢了!',
			subtitle:'《查詢方式》\n  • 直接輸入要查詢的詞彙\n • 透過對話詢問來查詢\n • 依照篇章來探索條目',
			text:'**[!]您可以使用下方建議卡片來嘗試**',
			}));
	conv.ask(new Suggestions('查詢主分類'));
	conv.ask(new Suggestions(text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)],'說明'+text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)]+'是甚麼','定義'+text_array[parseInt(Math.random()*2029)],'查詢'+text_array[parseInt(Math.random()*2029)]));
	conv.ask(new Suggestions('關於這部辭典','➥結束查詢'));

});

app.intent('查詢字典', (conv,{input}) => {

	result=dictionary[input];
	console.log(result);
	
	if(result!==undefined){
	suggestion_array=sub_collcetion[result[1]];
	
	conv.ask(new SimpleResponse({speech: `<speak><p><s>${input}<break time="0.5s"/>${result[2]}</s><break time="0.5s"/><s>${result[4]}</s></p></speak>`,text: response_array[parseInt(Math.random()*5)]}));
	
	conv.ask(new BasicCard({  
		title:input,
		subtitle:result[2]+' \n'+result[3],
		text:'**'+result[4]+'**  \n  \n 來自'+result[0]+'/'+result[1],}));
	
	conv.ask(new Suggestions("查詢"+result[0]));
	
	for(i=0;i<4;i++){
		var number=parseInt(Math.random()*(suggestion_array.length-1));
		if(suggestion_array[number]!==input){conv.ask(new Suggestions(suggestion_array[number]));}
		}	
	
	}
	else{
	conv.ask(new SimpleResponse({speech:`<speak><p><s>我找不到你要查詢的詞彙</s></p></speak>`,
								 text:"找不到這個詞彙喔!"}));                 		
	
	const hasWebBrowser =conv.surface.capabilities.has('actions.capability.WEB_BROWSER');
		
	if(hasWebBrowser){
        conv.ask(new BasicCard({
        image: new Image({url:'https://i.imgur.com/RrqFkIp.png',alt:'Pictures',}),
        }));
	}else{
        conv.ask(new BasicCard({
	    title: '查詢不到你輸入的詞彙',
        image: new Image({url:'https://i.imgur.com/RrqFkIp.png',alt:'Pictures',}),
        }));
	}
	conv.ask(new Suggestions(text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)],'說明'+text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)]+'是甚麼','定義'+text_array[parseInt(Math.random()*2029)],'查詢'+text_array[parseInt(Math.random()*2029)]));

	}
		conv.ask(new Suggestions('➥結束查詢'));
});


app.intent('選擇類別', (conv,{article}) => {

if(main_catagory.indexOf(article)===-1){
  conv.ask('請輕觸下方卡片來選擇查詢篇章');
  conv.ask(new Carousel({
	  title: '主分類',
	  items: {
		'總則篇': {
		  title: '總則篇',
		description: '總則',},
		'環保篇': {
		  title: '環保篇',
		description: '一般環保事項、環境影響評估',},
		'機電篇': {
		  title: '機電篇',
		  description: '車輛、系統保證  \n電力、號誌、電訊',},
		'規劃篇': {
		  title: '規劃篇',
		  description: '綜合、營運、運轉調度、用地、場站、管考、圖資',},
		'安全篇': {
		  title: '安全篇',
		  description: '一般安全、營運安全、施工安全',},
		'工管篇': {
		  title: '工管篇',
		  description: '採購、工程履約管理、品保管理、材料管理、材料試驗',},
		'土建篇': {
		  title: '土建篇',
		  description: '工務、地工、結構、建築、軌道、測量',}
	},}));
}
else{
	 conv.user.storage.main_article=article;
	conv.ask(new Suggestions('查詢主分類'));
	
	if(main_catagory.indexOf(article)!==-1){
	  conv.ask('請選擇「'+article+'」以下的子分類');

	if(article==="環保篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'一般環保事項': {title: '一般環保事項',description: ' ',},
			'環境影響評估': {title: '環境影響評估',description: ' ',},
			'水污染防治': {title: '水污染防治',description: ' ',},
			'空氣污染防制': {title: '空氣污染防制',description: ' ',},
			'噪音及振動污染防治': {title: '噪音及振動污染防治',description: ' ',},
			'廢棄物污染防治': {title: '廢棄物污染防治',description: ' ',},
		},}));
	}
	else if(article==="機電篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'車輛': {title: '車輛',description: ' ',},
			'系統保證': {title: '系統保證',description: ' ',},
			'電力': {title: '電力',description: ' ',},
			'號誌': {title: '號誌',description: ' ',},
			'電訊': {title: '電訊',description: ' ',},
			'水環(一般機電)': {title: '水環(一般機電)',description: ' ',},
			'廠區設備': {title: '廠區設備',description: ' ',},
		},}));
	}
	else if(article==="規劃篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'綜合': {title: '綜合',description: ' ',},
			'經濟與財務效益': {title: '經濟與財務效益',description: ' ',},
			'營運': {title: '營運',description: ' ',},
			'運轉調度': {title: '運轉調度',description: ' ',},
			'用地': {title: '用地',description: ' ',},
			'場站': {title: '場站',description: ' ',},
			'管考': {title: '管考',description: ' ',},
			'圖資': {title: '圖資',description: ' ',},
		},}));		
	}
	else if(article==="安全篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'一般安全': {title: '一般安全',description: ' ',},
			'營運安全': {title: '營運安全',description: ' ',},
			'施工安全': {title: '施工安全',description: ' ',},
		},}));		
	}
	else if(article==="工管篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'採購': {title: '採購',description: ' ',},
			'工程履約管理': {title: '工程履約管理',description: ' ',},
			'品保管理': {title: '品保管理',description: ' ',},
			'材料管理': {title: '材料管理',description: ' ',},
			'材料試驗': {title: '材料試驗',description: ' ',},
		},}));	
	}
	else if(article==="土建篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'工務': {title: '工務',description: ' ',},
			'地工': {title: '地工',description: ' ',},
			'結構': {title: '結構',description: ' ',},
			'建築': {title: '建築',description: ' ',},
			'軌道': {title: '軌道',description: ' ',},
			'測量': {title: '測量',description: ' ',},
		},}));	
	}
	else{
	suggestion_array=sub_collcetion["總則"];
    conv.ask(new SimpleResponse({               
		speech: `<speak><p><s>以下是總則子分類的隨機條目，選擇來查看內容</s></p></speak>`,
		text: '對應的隨機條目如下顯示'}));
	conv.ask(new BasicCard({
			title:"總則篇/總則",
			subtitle:'以下是該子分類的隨機條目',
			text:'**[!]您可以使用下方建議卡片來嘗試**',
			}));

	for(i=0;i<8;i++){
		var number=parseInt(Math.random()*(suggestion_array.length-1));
		conv.ask(new Suggestions(suggestion_array[number]));}
	
	}
  }
  else{
  conv.ask('請輕觸下方卡片來選擇查詢篇章');
  conv.ask(new Carousel({
	  title: '主分類',
	  items: {
		'總則篇': {
		  title: '總則篇',
		description: '總則',},
		'環保篇': {
		  title: '環保篇',
		description: '一般環保事項、環境影響評估',},
		'機電篇': {
		  title: '機電篇',
		  description: '車輛、系統保證  \n電力、號誌、電訊',},
		'規劃篇': {
		  title: '規劃篇',
		  description: '綜合、營運、運轉調度、用地、場站、管考、圖資',},
		'安全篇': {
		  title: '安全篇',
		  description: '一般安全、營運安全、施工安全',},
		'工管篇': {
		  title: '工管篇',
		  description: '採購、工程履約管理、品保管理、材料管理、材料試驗',},
		'土建篇': {
		  title: '土建篇',
		  description: '工務、地工、結構、建築、軌道、測量',}
	},}));

	}
}
	conv.ask(new Suggestions('➥結束查詢'));

});

app.intent('子分類選擇', (conv, input, option) => {

if(main_catagory.indexOf(option)!==-1){

	  conv.ask('請選擇「'+option+'」以下的子分類');
	  conv.user.storage.main_article=option;
	
	if(option==="環保篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'一般環保事項': {title: '一般環保事項',description: ' ',},
			'環境影響評估': {title: '環境影響評估',description: ' ',},
			'水污染防治': {title: '水污染防治',description: ' ',},
			'空氣污染防制': {title: '空氣污染防制',description: ' ',},
			'噪音及振動污染防治': {title: '噪音及振動污染防治',description: ' ',},
			'廢棄物污染防治': {title: '廢棄物污染防治',description: ' ',},
		},}));
	}
	else if(option==="機電篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'車輛': {title: '車輛',description: ' ',},
			'系統保證': {title: '系統保證',description: ' ',},
			'電力': {title: '電力',description: ' ',},
			'號誌': {title: '號誌',description: ' ',},
			'電訊': {title: '電訊',description: ' ',},
			'水環(一般機電)': {title: '水環(一般機電)',description: ' ',},
			'廠區設備': {title: '廠區設備',description: ' ',},
		},}));
	}
	else if(option==="規劃篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'綜合': {title: '綜合',description: ' ',},
			'經濟與財務效益': {title: '經濟與財務效益',description: ' ',},
			'營運': {title: '營運',description: ' ',},
			'運轉調度': {title: '運轉調度',description: ' ',},
			'用地': {title: '用地',description: ' ',},
			'場站': {title: '場站',description: ' ',},
			'管考': {title: '管考',description: ' ',},
			'圖資': {title: '圖資',description: ' ',},
		},}));		
	}
	else if(option==="安全篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'一般安全': {title: '一般安全',description: ' ',},
			'營運安全': {title: '營運安全',description: ' ',},
			'施工安全': {title: '施工安全',description: ' ',},
		},}));		
	}
	else if(option==="工管篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'採購': {title: '採購',description: ' ',},
			'工程履約管理': {title: '工程履約管理',description: ' ',},
			'品保管理': {title: '品保管理',description: ' ',},
			'材料管理': {title: '材料管理',description: ' ',},
			'材料試驗': {title: '材料試驗',description: ' ',},
		},}));	
	}
	else if(option==="土建篇"){
	  conv.ask(new Carousel({
		  title: 'Carousel Title',
		  items: {
			'工務': {title: '工務',description: ' ',},
			'地工': {title: '地工',description: ' ',},
			'結構': {title: '結構',description: ' ',},
			'建築': {title: '建築',description: ' ',},
			'軌道': {title: '軌道',description: ' ',},
			'測量': {title: '測量',description: ' ',},
		},}));	
	}
	else{
	option="總則";
	suggestion_array=sub_collcetion[option];
	
    conv.ask(new SimpleResponse({               
		speech: `<speak><p><s>以下是${option}子分類的隨機條目，選擇來查看內容</s></p></speak>`,
		text: '對應的隨機條目如下顯示'}));
	conv.ask(new BasicCard({
			title:'總則篇/'+option,
			subtitle:'以下是該子分類的隨機條目',
			text:'**[!]您可以使用下方建議卡片來嘗試**',
			}));

	for(i=0;i<8;i++){
		var number=parseInt(Math.random()*(suggestion_array.length-1));
		if(suggestion_array[number]!==input){conv.ask(new Suggestions(suggestion_array[number]));}
		}	
	}
}
else if (sub_catagory.indexOf(option)!==-1){
	suggestion_array=sub_collcetion[option];

    conv.ask(new SimpleResponse({               
		speech: `<speak><p><s>以下是${option}子分類的隨機條目，選擇來查看內容</s></p></speak>`,
		text: '對應的隨機條目如下顯示'}));

	conv.ask(new BasicCard({
			title:conv.user.storage.main_article+'/'+option,
			subtitle:'以下是該子分類的隨機條目',
			text:'**[!]您可以使用下方建議卡片來嘗試**',
			}));

	for(i=0;i<8;i++){
		var number=parseInt(Math.random()*(suggestion_array.length-1));
		if(suggestion_array[number]!==input){conv.ask(new Suggestions(suggestion_array[number]));}
		}	
	}
else{
  conv.ask('查詢過程中發生錯誤，\n請輕觸下方卡片來選擇查詢篇章');
  conv.ask(new Carousel({
	  title: '主分類',
	  items: {
		'總則': {
		  title: '總則篇',
		description: '總則',},
		'環保篇': {
		  title: '環保篇',
		description: '一般環保事項、環境影響評估',},
		'機電篇': {
		  title: '機電篇',
		  description: '車輛、系統保證  \n電力、號誌、電訊',},
		'規劃篇': {
		  title: '規劃篇',
		  description: '綜合、營運、運轉調度、用地、場站、管考、圖資',},
		'安全篇': {
		  title: '安全篇',
		  description: '一般安全、營運安全、施工安全',},
		'工管篇': {
		  title: '工管篇',
		  description: '採購、工程履約管理、品保管理、材料管理、材料試驗',},
		'土建篇': {
		  title: '土建篇',
		  description: '工務、地工、結構、建築、軌道、測量',}
	},}));

}

});


app.intent('關於《鐵道辭典》', (conv) => {
	conv.ask(new SimpleResponse({ 
					speech: `<speak><p><s>《鐵道辭典》</s><s>由交通部鐵路改建工程局提供，主要內容為傳統鐵路、高速鐵路、捷運系統等相關名詞(含中、英、日文)彙編及釋義。</s></p></speak>`,
					text: '說明如下'}));
	conv.ask(new Table({
			   title: '《鐵道辭典》',
			   columns: [{header: "以下是官方版權頁的詳細資訊，請查照。",align: 'LEADING',},],
			   rows: [{cells: ["書　　名：鐵道辭典  \n出版機關：交通部鐵路改建工程局  \n出版日期：100年12月  \n電　　話：(02)89691900  \n地　　址：新北市板橋區縣民大道2段7號20樓  \n版　　面：A4  \n頁　　數：447 頁  \nＩＳＢＮ：978-986-03-1234-8"],
			   dividerAfter: false,},],
			   buttons: new Button({title: '《鐵道辭典》',url:'https://www.rb.gov.tw/showpage.php?lmenuid=10&smenuid=71&tmenuid=109&infoid=958',display: 'CROPPED',}),}));
	conv.ask(new Suggestions(text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)],'說明'+text_array[parseInt(Math.random()*2029)],text_array[parseInt(Math.random()*2029)]+'是甚麼','定義'+text_array[parseInt(Math.random()*2029)],'查詢'+text_array[parseInt(Math.random()*2029)]));
	conv.ask(new Suggestions('➥結束查詢'));

});


app.intent('結束對話', (conv) => {
		conv.user.storage = {}; //離開同時清除暫存資料
		conv.ask('希望能幫上一點忙!');
		conv.ask(new SimpleResponse({speech: '下次見',text: '下次見 👋',}));
		conv.close(new BasicCard({   
			title: '感謝您的使用!', 
			text:'如果有任何需要改進的地方，  \n歡迎到簡介頁面評分或給予反饋，謝謝!', 
			buttons: new Button({title: '開啟本程式的商店頁面',url: 'https://assistant.google.com/services/a/uid/000000862113b0f6',}),
	  })); 
});


// Set the DialogflowApp object to handle the HTTPS POST request.
exports.tw_rail_dictionary = functions.https.onRequest(app);