{
"0":"生活是個吃軟怕硬的東西。你弱他就強，你強他就弱。",
"1":"人生就像水珠，經過不懈努力可以穿透石頭，雖然穿過那石頭不是一時間的事，但只要有堅持不懈的精神，沒有什麼事做不成。",
"2":"時間是小偷，他來時悄無聲息，走後損失慘重，機會也是如此。",
"3":"有些事我們明知道是錯的，也要去堅持，因為不甘心;而有些人我們明知道是愛的，也要去放棄，是因為沒結果;有時候我們明知道沒有路了，卻還在前行，因為習慣了。",
"4":"人生就像河流，只有找準了河流的軌跡，才能判斷出河流未來的方向！",
"5":"越有故事的人越沉靜簡單，越膚淺單薄的人越浮躁不安。真正的強者，不是沒有眼淚的人，而是含著眼淚依然奔跑的人。我們要敢於背上超出自己預料的包袱，努力之後，你會發現自己要比想像的優秀很多。",
"6":"不被重重的擊倒，又怎麼能華麗的站起。",
"7":"藏在心底的話並不是故意要去隱瞞,只是並不是所有的疼痛都可以吶喊。",
"8":"有時，放棄是另一種堅持。任何事，任何人，都會成為過去。是你的終究是你的，你錯失了夏花絢爛，必將會走進秋葉靜美。很多事，過去了，很多人，離開了，經歷的多了，心就堅強了，路就踏實了。",
"9":"當你忘了自己的過去，滿意自己的現在，漠視自己的未來，你就站在了生活的最高處。當成功不會讓你太高興，失敗不會把你怎麼樣，平淡不會淹沒你時，你就站在了生命的最高處。當你以微笑的心想到了過去，以希望的心向前看，以寬厚的心向下看，以坦然的心向上看時，你就站在了靈魂的最高處。",
"10":"一粒種子，就是要慢慢成熟，誰也決定不了它成長的速度，而你手裡的蘋果，耽擱了時間，就不再好吃了，還原世界本來的面目，一切慢慢來。",
"11":"留一份沉默給自己，你不必理會別人怎樣評論你，亮出真實的自己，在別人爭名奪利時，只須澄清自己的心靈，別讓渾濁的污垢沾上你。",
"12":"人生是船，有航空母艦，也有小小木筏，航空母艦羡慕小小木筏的逍遙，小小木筏羡慕航空母艦的戰場經驗。你羡慕別人的人生，殊不知，別人亦在唏噓自己崇拜著你。",
"13":"如果我們把生活中的這些起起落落看得太重，那麼生活對於我們來說永遠都不會坦然，永遠都沒有歡笑。人生應該有所追求，但暫時得不到並不會阻礙日常生活的幸福，因此，擁有一顆平常心，是人生必不可少的潤滑液劑。",
"14":"人的一生，所懼何其多。正因為如此，勇氣之重要，很多時候往往成了一件事情能否成功的關鍵。很多人，在那些自卑而內斂的時光裡早已一身的本領，可就是因為缺乏勇氣和自信，讓自己的才華成了深巷子裡的好酒，錯過了很多機會，浪費了許多時光。",
"15":"別站在人生的十字路口徘徊不定，猶豫不決。人生就這麼一次未知的旅行，在乎的是沿途的風景和旅行的心情。不會因為你的停留爾美麗的風景終止，走過的路已經成為你背後的風景。保持一顆平和的心，享受每一刻的感覺，欣賞每一刻的風景，這就是無悔的人生。",
"16":"要忘記，快樂並非取決於你是什麼人，或你擁有什麼，它完全來自於你的思想。你的未來大半由你今天的思想所決定。所以，讓你的心中注滿希望信心真愛與成功的想法。",
"17":"也許努力了那麼久，最終依然什麼都沒有收到，心裡很沮喪，甚至懷疑努力的意義。但這同樣不是放棄努力的藉口，因為努力從來不見得成功，但你能感覺到，努力奮鬥的歲月裡，你和別人不一樣。",
"18":"勤奮是你生命的密碼，能譯出你一部壯麗的史詩。",
"19":"讓我們將事前的憂慮，換為事前的思考和計劃吧！",
"20":"人生多一份挫折，就多一份人生的感悟；人生多一次跌打，就多一條抗爭的經驗。",
"21":"人生偉業的建立，不在能知，乃在能行。",
"22":"任何的限制，都是從自己的內心開始的。",
"23":"善於與人溝通，適度採納別人意見。",
"24":"如果懼怕前面跌宕的山岩，生命就永遠只能是死水一潭。",
"25":"生活不會否定任何人，就怕自己否定生活。",
"26":"忙於採集的蜜蜂，無暇在人前高談闊論。",
"27":"你追我趕拼搏爭先，流血流汗不留遺憾。",
"28":"停止拜訪就是停止呼吸，停止增員就是消滅生機。",
"29":"杜絕事必躬親，學會抓大放小。",
"30":"如果有天我們湮沒在人潮之中，庸碌一生，那是因為我們沒有努力要活得豐盛。",
"31":"我們這個世界，從不會給一個傷心的落伍者頒發獎牌。",
"32":"一步主動，步步主動，步步領先，享受光榮；一步被動，步步被動，步步落伍，煎熬受窮。",
"33":"一個能從別人的觀念來看事情，能了解別人心靈活動的人，永遠不必為自己的前途擔心。",
"34":"一個人最大的敵人是自己，沒有完不成的任務，只有失去信心的自己。",
"35":"志在峰巔的攀登者，不會陶醉在沿途的某個腳印之中。",
"36":"慾望以提升熱忱，毅力以磨平高山。",
"37":"勇士搏出驚濤駭流而不沉淪，懦夫在風平浪靜也會溺水。",
"38":"一個人最大的破產是絕望，最大的資產是希望。",
"39":"「不可能」只存在於蠢人的字典里。",
"40":"含淚播種的人一定能含笑收穫。",
"41":"靠山山會倒，靠水水會流，靠自己永遠不倒。",
"42":"只要路是對的，就不怕路遠。",
"43":"抱最大的希望，為最大的努力，做最壞的打算。",
"44":"當一個人真正覺悟的一刻，他放棄追尋外在世界的財富，而開始追尋他內心世界的真正財富。",
"45":"對於攀登者來說，失掉往昔的足跡並不可惜，迷失了繼續前時的方向卻很危險。",
"46":"奮鬥者在汗水彙集的江河裡，將事業之舟駛到了理想的彼岸。",
"47":"很多失敗不是因為能力有限，而是因為沒有堅持到底。",
"48":"機會不會主動找到你，必須亮出你自己。",
"49":"駕馭命運的舵是奮鬥。不抱有一絲幻想，不放棄一點機會，不停止一日努力。",
"50":"困難和挫折都不可怕，可怕的是喪失做人的志氣和勇氣。",
"51":"征服畏懼、建立自信的最快最確實的方法，就是去做你害怕的事，直到你獲得成功的經驗。",
"52":"再長的路，一步步也能走完，再短的路，不邁開雙腳也無法到達。",
"53":"懦弱的人只會裹足不前，莽撞的人只能引為燒身，只有真正勇敢的人才能所向披靡。",
"54":"失敗是什麼？沒有什麼，只是更走近成功一步；成功是什麼？就是走過了所有通向失敗的路，只剩下一條路，那就是成功的路。",
"55":"梯子的梯階從來不是用來擱腳的，它只是讓人們的腳放上一段時間，以便讓別一隻腳能夠再往上登。",
"56":"相信生活是美好的，相信人生是充滿希望的，懂得人比錢重要，能用錢解決的問題都不是問題。",
"57":"低頭是一種能力，它不是自卑，也不是怯弱，它是清醒中的嬗變。有時，稍微低一下頭，或者我們的人生路會更精彩。",
"58":"這一秒不放棄，下一秒就有希望！堅持下去才可能成功！",
"59":"真正成功的人生，不在於成就的大小，而在於你是否努力地去實現自我，喊出自己的聲音，走出屬於自己的道路。",
"60":"天塌下來，有個高的人幫你扛著，可是你能保證，天塌下來的時候，個兒高的人沒在彎腰嗎？之後，還不是得靠自己！",
"61":"壓力是不可避免的，失眠是無可奈何的，所以不要著急，不要煩躁，心平氣和地接受。躲不開就接著，晚上睡不著那就白天睡。",
"62":"幫別人的事做完就忘記，別人為自己做的事時時記著，哪怕這個人只有那麼一次好，他也是曾經幫助過你的人。",
"63":"別自製壓力，我們沒有必要跟著時間走，只需跟著心態和能力走，隨緣，儘力，達命，問心無愧，其他的，交給天。",
"64":"熱愛工作，投身事業，在這一過程中，抑制私心，陶冶人格，同時積累經驗，提高能力。這樣，才能獲得周圍人們的信任和尊敬。",
"65":"人活著就是為了解決困難。這才是生命的意義，也是生命的內容。逃避不是辦法，知難而上往往是解決問題的最好手段。",
"66":"當你不去旅行，不去冒險，不去談一場戀愛，不過沒試過的生活，每天只是掛在臉書，刷著IG，逛著蝦皮，做些歲都能做的事情，那麼你要青春有什麼用?",
"67":"即使遭遇了人間最大的不幸，能夠解決一切困難的前提是——活著。只有活著，才有希望。無論多麼痛苦、多麼悲傷，只要能夠努力地活下去，一切都會好起來。",
"68":"相信夢想是價值的源泉，相信眼光決定未來的一切，相信成功的信念比成功本身更重要，相信人生有挫折沒有失敗，相信生命的質量來自決不妥協的信念。",
"69":"如果寒暄只是打個招呼就了事的話，那與猴子的呼叫聲有什麼不同呢？事實上，正確的寒暄必須在短短一句話中明顯地表露出你對他的關懷。",
"70":"跟正常人講道理，不正常的人不需要道理。該和善的時候一定要和善，該罵的時候千萬別忍讓，時時處處的彬彬有禮那是爛好人。",
"71":"給自己一份好心情，讓世界對著你微笑：給別人一份好心情，讓生活對我們微笑，好心情是人生的財富，讓好心情與我們時時相伴。",
"72":"一切都經過了，一切都走過了，一切都熬過了，生命的底色里，增了韌，添了柔。這時候平和下來的生命，已經沉靜到擾不亂，已經穩健到動不搖，已經淡定到風打不動。",
"73":"心情，是一種感情狀態，擁有了好心情，也就擁有了自信，繼而擁有了年輕和健康。就擁有了對未來生活的嚮往，充滿期待，讓我們擁有一份好心情吧，因為生活著就是幸運和快樂。",
"74":"老虎不發威他就一隻病貓！發威了他就是王者！所以人人都可以是王者但同時也可能是病貓，關鍵在於你自己的選折！",
"75":"生存是人類第一要務，而快樂卻是生存的唯一原則。快樂是一個人心靈和精神所表現出來的滿足，是最最純潔和高尚的享受。",
"76":"既然人生的幕布已經拉開，就一定要積極的演出；既然腳步已經跨出，風雨坎坷也不能退步；既然我已把希望播在這裡，就一定要堅持到勝利的謝幕……",
"77":"你的心應該保持這種模樣，略帶發力的緊張，不鬆懈，對待不定有坦然。損傷是承載，沉默是擴展。終結是新的開始。如此，我會為你的心產生敬意。",
"78":"風帆，不掛在桅杆上，是一塊無用的布；桅杆，不掛上風帆，是一根平常的柱；理想，不付諸行動是虛無縹緲的霧；行動，而沒有理想，是徒走沒有盡頭的路。",
"79":"生命中，好多的事是這樣，生活中，好多的情是這樣，沒有理由，也無需理由，愛就是愛，喜歡就是喜歡，沒有結果，也無須結果，心甘情願，無怨無悔。",
"80":"我們的生命，就是以不斷出發的姿勢得到重生。為某些只有自己才能感知的來自內心的召喚，走在路上無法停息。",
"81":"人生的快樂在於自己對生活的態度，快樂是自己的事情，只要願意，你可以隨時調換手中的遙控器，將心靈的視窗調整到快樂頻道。學會快樂，即使難過，也要微笑著面對。",
"82":"我未曾見過一個早起、勤奮、謹慎、誠實的人抱怨命運不好；良好的品格，優良的習慣，堅強的意志，是不會被假設所謂的命運擊敗的。",
"83":"如果有一天，你偶然看到了這些文字，我希望這幾分鐘是真正屬於你自己的，在這裡你給自己加油，打氣，繼續去完成你曾經的夢想，勇敢的去挑戰自己，歷練自己！",
"84":"漫漫長路，你願一人獨撐，忍受著孤獨與寂寞，承受著體力與精神的壓迫，只任汗水溶於淚水，可腳步卻從不停歇。好樣的，縱然得不了桂冠，可堅持的你，定會贏得最後的掌聲。",
"85":"生活一直都是美好的，雖然有辛苦的奔波，有人情的淡漠，也有偶爾的碰壁和受挫，有許許多多的痛和不幸，然而，這些都不能掩飾了生活的美好，生活中總有許多值得我們追求和嚮往的東西。",
"86":"生活中，我們每天都在嘗試嘗試中，我們走向成功品味失敗，走過心靈的陰雨晴空運動員們，不要放棄嘗試無論失敗與否重要的是你勇於參與的精神，付出的背後是勝利無論是否成功，我們永遠讚美你，你們永遠是我們的驕傲。",
"87":"不為掌聲的詮釋，不為刻意的征服，只有辛勤的汗水化作追求的腳步，心中堅定的信念，腳下沉穩的步伐，你用行動訴說著一個不變的真理，沒有比腳更長的路，沒有比人更高的山，希望在終點向你招手，努力吧用你堅韌不拔的毅志，去迎接終點的鮮花與掌聲，相信成功屬於你。",
"88":"用最少的悔恨面對過去。用最少的浪費面對現在。用最多的夢面對未來。",
"89":"每個人的人生都有兩條路，一條用心走，叫做夢想；一條用腳走，叫做現實。心走得太慢，現實會蒼白；腳走得太慢，夢不會高飛。人生的精彩，總是心走得很美，而與腳步能合一。",
"90":"忍讓，第一次叫氣度，第二次是寬容，第三次就變成了軟弱。",
"91":"只要別人和你在一起，你讓別人感覺很舒服，你必成大業！",
"92":"學著看淡一些人和事物，這才是對自己最好的保護。",
"93":"生命不是一場賽跑，而是一次旅行。比賽在乎終點，而旅行在乎沿途風景，好心情才會有好風景。",
"94":"生命太短暫，哪有時間遺憾，一分鐘都不要留給那些讓你不快的人或事。若不是終點，請微笑一直向前！",
"95":"不要因為暫時的得到而失去未來的擁有，靠犧牲別人得到的更不會長久。沒辦法，這是天道。",
"96":"這個世界不是所有的人都懂你，被不懂的人誤解無須爭辯，我們選擇沉默；有時被最愛的人誤解，我們難過到不想爭辯，也只有選擇沉默。生命中往往有很多無言以對的時刻。不是所有的是非都能辯明，不是所有的糾葛都能理清，有時沉默就是我們最好的回答和詮釋。",
"97":"想做大，需要的是不停地做，重複的做，用心去做，當你真的努力了，付出了，你會發現自己潛力無限！每一份收穫都是努力出來的，每天鼓勵自己，越努力，越幸運，越感恩，越幸福。",
"98":"在別人肆意說你的時候，問問自己，到底怕不怕，輸不輸的起。不必害怕，不要後退，不須猶豫，難過的時候就一個人去看看這世界。多問問自己，你是否已經為了夢想而竭盡了全力？",
"99":"脾氣，往往是最能觀照自己性情和內心的時候。所以，我們應該要善用它，把它當作是一面鏡子，時時觀測一下自己的種種變化、種種思慮、種種念頭。久而久之，通過它我們就能慢慢調伏好自己的情緒和很多的陋習，並在最後不住、不染、不著，復見本來的清淨。",
"100":"世間所有萬物都有心靈相吸，皆有因果輪迴，一顆無人問津的小草小花，也能給人類帶來新鮮的空氣；你種下一顆樹，那棵樹長大以後會為你遮風擋雨；你養一隻寵物，那隻寵物會給你生活帶來樂趣；你撒下什麼種子，就收穫什麼果實，你是什麼樣的人，就會有怎樣的人生！",
"101":"人生並非坦途，只要你仍在行走，難免遇到磕磕碰碰，難免遭遇失敗被人嘲笑。然而人最可悲的不是遇到失敗，遇到失敗至少證明你曾接近成功。最可悲的是什麼都不曾經歷，一年與一天沒有任何區別。雖然可能遍體鱗傷，但驀然回首，你已經比那些原地踏步的人領先了一大截。",
"102":"一輩子雖然漫長，但過去了也就是彈指一揮。你會不斷的遇見一些人，也會不停的和一些人說再見，從陌生到熟悉，從熟悉再回陌生，從臭味相投到分道揚鑣，從相見恨晚到不如不見……不是每個人都會是你的伙伴，也不是每個朋友都能肝膽相見，無煩或惱，緣到，報之以大笑，緣散，報之以不厭。",
"103":"有喜有悲才是人生，有苦有甜才是生活。生活壞到一定程度就會好起來，因為它無法更壞，我們心中應總是充滿陽光。活在當下，享受生活。任何事情即使再壞，也有好的一面，選擇人生最積極的一面；心態好，一切才會向好的方向轉變；決定成敗的關鍵是心態，而不是智商；生活在天堂還是地獄，取決於你的態度。",
"104":"你也許正面臨兩難的選擇，你也許正經歷難言的磨難，可誰敢說這看似殘酷的更迭，不是你變得越來越好的憑證？從懵懂到睿智，從幼稚到成熟，當乾練取代生疏，我們都在屬於自己的成長之路上腳步漸穩。",
"105":"沒有特別幸運，那麼請先特別努力，別因為懶惰而失敗，還矯情的將原因歸於自己倒霉。你必須特別努力，才能顯得毫不費力，原來不懂，現在懂了：越幸運就得越努力，越懶惰就越倒霉，別人看到的是你累，最後輕鬆的是你自己。努力和收穫，都是自己的，與他人無關。",
"106":"我有足夠的野心，來迎接任何要對我狂的人。",
"107":"成功的人，從不炫耀眼前的名利，而是牢記背後的辛酸。",
"108":"寧可在嘗試中失敗，也不在保守中成功。",
"109":"志在頂峰的人，決不會因留戀半山腰的奇花異草而停止攀登的步伐。",
"110":"成長不是改變自己，而是不斷完善自己。",
"111":"金錢可以買來舒適和享受，買不來知識與健康、真摯的情感和愛情。",
"112":"恆心是成功的基石，努力是成功的階梯。",
"113":"打開一切科學的鑰匙毫無異議的是問號。",
"114":"情盡時，自有另一番新境界，所有的悲哀也不過是歷史。",
"115":"我們的理想，不管怎麼樣，都屬於未來。",
"116":"你成不了心態的主人，必然會淪為情緒的奴隸。",
"117":"三言兩語，安慰自己，冷言冷語，堅持自己！",
"118":"我現在不會和以前那樣了，那些曾經欺騙過我的，不會再原諒。",
"119":"初戀是美術，熱戀是技術，結婚是藝術，離婚是手術。",
"120":"成功不是擊敗別人，而是改變自己！",
"121":"有些事，明知是錯的，也要去堅持，因為不甘心。",
"122":"什麼叫作失敗？失敗是到達較佳境地的第一步。",
"123":"十年一博六月夢，贏得寒窗錦繡程。",
"124":"我們不是等待未來，我們是創造未來，加油，努力奮鬥。",
"125":"不要停止學習。不管學習什麼，語言，廚藝，各種技能。",
"126":"做人之道，當小心謹慎，謙又而謙。",
"127":"人生如天氣，說變就變，方才朗朗晴空，現如今已烏雲密布。",
"128":"三思而後行的人，很少會做錯事情。",
"129":"覺得生活屬於自己的朋友，為自己按個讚！",
"130":"待人退一步，愛人寬一寸，人生自然活得很快樂。",
"131":"認真付出過的感情在日後回想起來，連吵過的架都彌足珍貴。",
"132":"努力不一定會成功，但不努力一定不會成功。",
"133":"意志是獨一無二的個體所擁有的以糾正自己的自動性的力量。",
"134":"冬天已經到來，春天還會遠嗎？",
"135":"生活可能面目猙獰，但一定要以漂亮的姿態去迎戰。",
"136":"曾經那份不完美的感情已經逝世，如今我要重新將它復活。",
"137":"成功不需要過多的語言，只有付出和行動。",
"138":"男兒不展同雲志，空負天生八尺軀。",
"139":"青春最漂亮的裝飾應該是勇氣。",
"140":"一切都是浮雲，既然你無情我又何必有意。",
"141":"青年是學習智慧的時期，中年是付諸實踐的時期。",
"142":"真理之所以為真理，只是因為它是和謬誤以及虛偽對立的。",
"143":"有能力的人影響別人，沒能力的人，受人影響。",
"144":"樹多枝，路多岐，有所棄，才有所取。",
"145":"交朋友，不僅要用話語去溝通，更要用心去交流。",
"146":"沒有堅強意志的人， 決不可能擔任天下大事。",
"147":"只要你是天鵝蛋，就是生在養雞場裡也沒有什麼關係。",
"148":"一個人生活，可以很快樂！可是，只有一個人，便不能說是幸福。",
"149":"選擇可能難，能堅持自我的選擇更需要自持力。",
"150":"如果你比別人更具智慧，別人會從你的行為看出來。",
"151":"無須在意別人的評說只要把自己的事情做好。",
"152":"炫耀是需要觀眾的，而炫耀恰恰讓我們失去觀眾。",
"153":"懦夫在未死以前，就已經死過好多次；勇士一生只死一次。",
"154":"年輕是本錢，但不發奮就不值錢。",
"155":"我無所事事地度過的今天，是昨天死去的人們所奢望的明天。",
"156":"與其不透徹地理解許多事，不如理解的事不多，但都能徹底。",
"157":"寧可被人笑一時，不可被人笑一輩子。",
"158":"你還有好多未完成的夢，你有什麼理由停下腳步。",
"159":"人生不是一種享樂，而是一樁十分沉重的工作。",
"160":"唯有經歷最深沉的痛楚，才換取最美好的事物。",
"161":"永遠都要記住你的人生掌握在你手中。",
"162":"我不是天生的王者，但我骨子裡流著不服輸的血液。",
"163":"做正確的事，再把事情做正確。",
"164":"怯懦是你最大的敵人，勇敢則是你最好的朋友。",
"165":"燃燒青春、踐行價值、共圓致富夢，我堅守、我擔當、我快樂。",
"166":"時間順流而下，生活逆水行舟。",
"167":"人生。不是一呼一吸放個屁就完事了。",
"168":"使人成熟的是經歷，而不是歲月。",
"169":"沒有什麼能一下打垮你，正如沒有什麼能一下拯救你。",
"170":"青春是一首歌，撥動我們的心弦；青春是一團火，點燃我們的熱血。",
"171":"勇敢，不一定有結果，但不勇敢，一定沒有結果。",
"172":"平平淡淡看世界，踏踏實實寫人生。",
"173":"勇敢的邁出第一步，心動不如行動吧！",
"174":"回首之前走過的路，唯一值得慶幸的是，我從未循規蹈矩的行走。",
"175":"生命是一座空城裝滿了妖言惑眾的愛情。",
"176":"你能用不同的方法解題，把學到的知識應用到實際中去，真了不起！",
"177":"如果你什麼也沒有，自信是你最後一張王牌。",
"178":"困難是一塊頑石，對於弱者它是絆腳石，對於強者它是墊腳石。",
"179":"時間久了，理想的鏡子起灰，需要多擦拭。",
"180":"放手一博去創業，不要給你的人生留下遺憾。",
"181":"沒人看好我，我就自己看好自己。",
"182":"第二天叫醒我的不是鬧鐘，其實，還是夢想。",
"183":"最好不要在夕陽西下的時候想什麼，而是在旭日初升的時候投入工作。",
"184":"如果不獻身給一個偉大的理想，生命就是毫無意義的。",
"185":"拼搏的汗水，能澆開理想的花朵。",
"186":"並非神仙才能燒陶器，有志的人總可以學得精手藝。",
"187":"自信，是無盡智慧的凝聚。平淡，是成功路上的驛站。",
"188":"失敗是常有的，成功是偶然的；付出是應該的，得到是暫時的。",
"189":"忘掉那黎明前的黑暗，記住那黎明後的曙光。",
"190":"人生最困難的不是努力，也不是奮鬥，而是做出正確的抉擇。",
"191":"離開不是為了分別，而是為了以最美的姿態再度重遇。",
"192":"不要以為你吃了多少苦，世界冠軍就是你的。",
"193":"拼一個三載春秋，搏一個青春無悔。",
"194":"我知道這一路必定是無比艱辛的，但是我會一直向前走。",
"195":"最難開口的是初次的問好和最終的道別。",
"196":"不是無知本身，而是對無知的無知，才是知識的死亡。",
"197":"一個人要不想被別人超越，就要不斷自我超越。",
"198":"活在懷疑與恐懼之中是在浪費生命。",
"199":"一日一錢，千日千錢；繩鋸木斷，水滴石穿！",
"200":"生活的道路一旦選定，就要勇敢地走到底，絕不回頭。",
"201":"人生有兩齣悲劇。一是萬念俱灰；另一是躊躇滿志。",
"202":"陽光總是會在陰天過後出現，是那般溫暖，那般耀眼。",
"203":"人最大的對手，就是自己的懶惰。",
"204":"既不回頭，何必不忘。既然無緣，何須誓言。",
"205":"我們經歷挫折，是因為上天不允許我們停止努力。",
"206":"內心強大就有自信，這不是你的財富可以給你的！",
"207":"註定得不到幸福，就不要去奢望那麼多。",
"208":"各存愚公之願，即可移山；共懷精衛之心，不難填海。",
"209":"能夠堅持到最後一刻的人，就是有本錢成功的人。",
"210":"在青年時期，我們給自己披上彩虹。",
"211":"只要心中有希望存在，就有幸福存在。",
"212":"我在等一個死皮賴臉，都不會離開我的人。",
"213":"既然你從這裡離開，那我就在這裡等你，不離不棄。",
"214":"灰心生失望，失望生動搖，動搖生失敗。",
"215":"每個看似低的起點，都是通往高峰的必經之路。",
"216":"恐懼自己受苦的人，就已經為自己的恐懼在受苦。",
"217":"你要想成為強者就必須要身體健康。",
"218":"當我們都老的時候，我希望——還能吻著你的牙床，直到永遠。",
"219":"你不努力沒人給你想要的生活。",
"220":"青春時代是一個短暫的美夢，當你醒來時，它早已消逝得無影無蹤。",
"221":"學者如登山焉，動而益高，如寢寐焉，久而益足。",
"222":"誰有進取的意志，誰就幹得成。",
"223":"無形的愛、無處不在。那就是親情。",
"224":"放得下，才能走得遠！有所放棄，才能有所追求。",
"225":"陽光不是給自己才是溫暖的，是要照耀所有人時，那才叫溫暖。",
"226":"總是控制不住自己的情緒，還是那麼喜歡衝動。",
"227":"因為你努力了，即使失敗，也是美好的！",
"228":"總想贏者必輸，不怕輸者必贏。",
"229":"沒有十全十美的人，只有實心實意的心。",
"230":"交會修理你的朋友。這種朋友正是你人生的導師。",
"231":"證明雞蛋是否變味了，大可不必把它吃完。",
"232":"告訴你一個寶藏的地點，它就在你的生命里。",
"233":"青春？這個詞賦予了太多足夠膚淺的理由。",
"234":"在難過的時候，不要忘記自己還要前進！",
"235":"拼一個秋冬春夏！贏一生無怨無悔！",
"236":"在寂寞無聊中，一個人才能感到跟關於思想的人在一起生活的好處。",
"237":"在有人要觸底線時，要笑著重申你的底線。",
"238":"如果你想勇往直前，那麼就學會不要對任何東西有依賴。",
"239":"如果有得選，就選最好的。如果沒得選，就盡力做到最好。",
"240":"腳踏實地沉著備戰，相信自己相信未來。",
"241":"人多不足以依賴，要生存只有靠自己。",
"242":"我不怕千萬人阻擋，只怕自己投降。",
"243":"世上沒有絕望的處境，只有對處境絕望的人。",
"244":"讓我們將事前的憂慮，換為事前的思考和計畫吧!",
"245":"當你感到悲哀痛苦時，最好是去學些什麼東西。學習會使你永遠立於不敗之地。",
"246":"世界上那些最容易的事情中，拖延時間最不費力。",
"247":"沒有創造的生活不能算生活，只能算活著。",
"248":"志在山頂的人，不會貪念山腰的風景。",
"249":"要想贏，就一定不能怕輸。不怕輸，結果未必能贏。但是怕輸，結果則一定是輸。",
"250":"天再高又怎樣，踮起腳尖就更接近陽光。",
"251":"微笑擁抱每一天，做像向日葵般溫暖的女子。",
"252":"如果心胸不似海，又怎能有海一樣的事業。",
"253":"命運如同手中的掌紋，無論多曲折，終掌握在自己手中。",
"254":"只做第一個我，不做第二個誰。",
"255":"只有經歷過地獄般的折磨，才有征服天堂的力量。只有流過血的手指才能彈出世間的絕唱。",
"256":"人生沒有彩排，每天都是現場直播。",
"257":"帶著感恩的心啟程，學會愛，愛父母，愛自己，愛朋友，愛他人。",
"258":"真正的強者，不是流淚的人，而是含淚奔跑的人。",
"259":"不要停止學習。不管學習什麼!",
"260":"不要等待機會，而要創造機會。",
"261":"人之所以能，是相信能。",
"262":"一個有信念者所開發出的力量，大於個只有興趣者。",
"263":"成功不是將來才有的，而是從決定去做的那一刻起，持續累積而成。",
"264":"要成功，就要長期等待而不焦躁，態度從容卻保持敏銳，不怕挫折且充滿希望。",
"265":"你要做的就是別人換不掉的，那你做不到怪誰，就是你自己沒用!",
"266":"沒有不進步的人生，只有不進取的人!",
"267":"有時候，你得停一下腳步，等一等心靈，讓心情平和，想一想自己生活中擁有的所有美好的東西。",
"268":"沒有傘的孩子，必須努力奔跑!",
"269":"當我覺得我倒霉了，我就會想：這是在揮灑我的霉運，揮灑之後，剩下的就全都是幸運了!",
"270":"沒有一種不通過蔑視、忍受和奮鬥就可以征服的命運。",
"271":"生活不是等待風暴過去，而是學會在雨中翩翩起舞。",
"272":"你可以很有個性，但某些時候請收斂。",
"273":"別小看任何人，越不起眼的人。往往會做些讓人想不到的事。",
"274":"沒有傘的孩子必須努力奔跑!",
"275":"我們什麼都沒有，唯一的本錢就是青春。夢想讓我與眾不同，奮鬥讓我改變命運!",
"276":"你不勇敢，沒人替你堅強!",
"277":"自信的生命最美麗!",
"278":"學會寬容，要有一顆寬容的愛心!",
"279":"心有多大，舞台就有多大。",
"280":"每天都冒出很多念頭，那些不死的才叫做夢想。",
"281":"不要為小事遮住視線，我們還有更大的世界。",
"282":"就算跑最後一名又怎樣，至少我又運動精神。而且我一定會跑完全程，只要跑到終點我就成功了!",
"283":"如果你的面前有陰影，那是因為你的背後有陽光。",
"284":"每一發奮努力的背後，必有加倍的賞賜。",
"285":"很多時候，不快樂並不是因為快樂的條件沒有齊備，而是因為活得還不夠簡單。",
"286":"要想改變我們的人生，第一步就是要改變我們的心態。只要心態是正確的，我們的世界就會的光明的。",
"287":"人生目標確定容易實現難，但如果不去行動，那么連實現的可能也不會有。",
"288":"世上只有一種英雄主義，就是在認清生活真相之後依然熱愛生活。",
"289":"生活不是林黛玉，不會因為憂傷而風情萬種。",
"290":"懂得感恩，是收穫幸福的源泉。懂得感恩，你會發現原來自己周圍的一切都是那樣的美好。",
"291":"人生就有許多這樣的奇蹟，看似比登天還難的事，有時輕而易舉就可以做到，其中的差別就在於非凡的信念",
"292":"當你不去旅行，不去冒險，不去談一場戀愛，不過沒試過的生活，每天只是掛著QQ，刷著微博，逛著淘寶，干著歲都能做的事情，那麼你要青春有什麼用。",
"293":"即使遭遇了人間最大的不幸，能夠解決一切困難的前提是——活著。只有活著，才有希望。無論多麼痛苦",
"294":"切都經過了，一切都走過了，一切都熬過了，生命的底色里，增了韌，添了柔。這時候平和下來的生命，已經沉靜到擾不亂，已經穩健到動不搖，已經淡定到風打不動。",
"295":"最體貼的是你的鞋子，不要嫌它髒，那是因為你走的路不幹凈。",
"296":"行動是成功的階梯，行動越多，登得越高。",
"297":"行動是治癒恐懼的良葯，而猶豫拖延將不斷滋養恐懼。",
"298":"心若大了，事情就小了。",
"299":"人生目標確定容易實現難，但如果不去行動，那麽連實現的可能也不會有。",
"300":"命是爸媽給的，珍惜點、路是自己走的，小心點！",
"301":"正是礁石的阻擋，才使浪花顯得美麗。",
"302":"在逆境中要看到生活的美，在希望中別忘記不斷奮鬥。",
"303":"燕子嘴上的春泥，別看它點點滴滴，築不成大廈，卻能壘起幸福之巢。",
"304":"有志者自有千方百計，無志者隻感千難萬難。",
"305":"人生是一條沒有回程的單行線，上帝不會給你一張返程的票。",
"306":"我不怕千萬人阻擋，隻怕自己投降。",
"307":"即使爬到最高的山上，一次也隻能腳踏實地地邁一步。",
"308":"任何的限製，都是從自己的內心開始的。",
"309":"不是境況造就人，而是人造就境況。",
"310":"沒有天生的信心，隻有不斷培養的信心。",
"311":"一個有信念者所開發出的力量，大於九十九個隻有興趣者。",
"312":"人不會苦一輩子，但總會苦一陣子。許多人為了逃避苦一陣子，卻苦了一輩子。",
"313":"即使是不成熟的嘗試，也勝於胎死腹中的策略。",
"314":"世上沒有絕望的處境，隻有對處境絕望的人。",
"315":"每一個成功者都有一個開始。勇於開始，才能找到成功的路。",
"316":"沒有口水與汗水，就沒有成功的淚水。",
"317":"不為失敗找理由，隻為成功找方法。",
"318":"成功的法則極為簡單，但簡單並不代表容易。",
"319":"無論才能知識多麽卓著，如果缺乏熱情，則無異紙上畫餅充飢，無補於事。",
"320":"最困難的時候，就是距離成功不遠了。",
"321":"偉人之所以偉大，是因為他與別人共處逆境時，別人失去了信心，他卻下決心實現自己的目標。",
"322":"積極的人在每一次憂患中都看到一個機會，而消極的人則在每個機會都看到某種憂患。",
"323":"當一個人先從自己的內心開始奮鬥，他就是個有價值的人。",
"324":"未曾失敗的人恐怕也未曾成功過。",
"325":"生命對某些人來說是美麗的，這些人的一生都為某個目標而奮鬥。",
"326":"積極思考造成積極人生，消極思考造成消極人生。",
"327":"任何業績的質變，都來自於量變的積累。",
"328":"環境不會改變，解決之道在於改變自己。",
"329":"沒有一種不通過蔑視忍受和奮鬥就可以征服的命運。",
"330":"隻要路是對的，就不怕路遠。",
"331":"苦想沒盼頭，苦幹有奔頭。",
"332":"人生最大的喜悅是每個人都說你做不到，你卻完成它了！",
"333":"高峰隻對攀登它而不是仰望它的人來說才有真正意義。",
"334":"隻有不斷找尋機會的人才會及時把握機會。",
"335":"生命的意義不在於馬到成功，而在於不斷求索。",
"336":"成功的秘訣之一就是不讓暫時的挫折擊垮我們。",
"337":"不為模糊不清的未來擔憂，隻為清清楚楚的現在努力。",
"338":"成功不是憑夢想和希望，而是憑努力和實踐。",
"339":"成功是一把梯子，雙手插在口袋裏的人是爬不上去的。",
"340":"當一個小小的心念變成成為行為時，便能成了習慣；從而形成性格，而性格就決定你一生的成敗。",
"341":"生命不是要超越別人，而是要超越自己。",
"342":"生命是屬於你的，你應該根據自己的願望去生活。",
"343":"心靈激情不在，就可能被打敗。",
"344":"要做的事情總找得出時間和機會；不願意做的事情也總能找得出藉口。",
"345":"每一個發奮努力的背後，必有加倍的賞賜。",
"346":"人生在世，最大的敵人不一定是外來的，而可能是我們自己。",
"347":"沒有傘的孩子，就必須努力奔跑!",
"348":"讓我們要將事前的憂慮，換為事前的思考和計畫吧！",
"349":"不要等待機會，而是要創造機會。",
"350":"機會不會主動找到你，必須要主動亮出你自己。",
"351":"靠山山會倒，靠水水會流，靠自己最可靠。",
"352":"用慾望提升熱忱，用毅力磨平高山。",
"353":"抱最大的希望，盡最大的努力，做最壞的打算。",
"354":"勤奮是你生命的密碼，能為你譜出一部壯麗的史詩。",
"355":"別自己製造壓力，我們沒有必要跟著時間走，只需跟著心態和能力走，凡事隨緣盡力達命問心無愧，其他的交給天。",
"356":"生活不會否定任何人，就怕自己先否定生活。",
"357":"一個人最大的破產是「絕望」，最大的資產是「希望」。",
"358":"「不可能」只存在於失敗者的字典裡。",
"359":"低頭是一種能力，它不是自卑，也不是怯弱，它是清醒中的轉化。有時，稍微低一下頭，或者我們的人生路會更精彩。",
"360":"用行動訴說著一個不變的真理，沒有比腳更長的路，沒有比人更高的山，希望在終點向你招手，用你堅韌不拔的毅志，去迎接終點的鮮花與掌聲，堅信成功屬於你。",
"361":"「生存」是人類第一要務，而快樂卻是生存的唯一原則。快樂是一個人心靈和精神所表現出來的滿足，是最最純潔和高尚的享受。",
"362":"失敗只是更走近成功一步；成功是走過了失敗的路，剩下最後的一條路。",
"363":"征服畏懼建立自信的最快最確實的方法，就是去做你害怕的事，直到你獲得成功的經驗。",
"364":"老虎不發威他就一隻病貓！發威了他就是王者！所以人人都可以是王者，但同時也可能是病貓，關鍵在於你自己的選擇！",
"365":"當你不去旅行，不去冒險，不去談一場戀愛，不過沒試過的生活，每天只是掛著網路，刷著臉書，逛著淘寶，幹著歲都能做的事情，那麼你要青春有什麼用?",
"366":"即使遭遇了人間最大的不幸，能夠解決一切困難的前提是——活著。只有活著，才有希望。無論多麼痛苦多麼悲傷，只要能夠努力地活下去，一切都會好起來。",
"367":"我們的生命，就是以不斷出發的姿勢得到重生。",
"368":"你不勇敢，沒人替你堅強！",
"369":"窮則思變，差則思勤!沒有比人更高的山，沒有比腳更長的路。",
"370":"很多時候，不快樂並不是因為快樂的條件沒有齊備，而是因為生活得還不夠簡單。",
"371":"要想改變我們的人生，第一步就是要改變的是心態。",
"372":"人生目標確定容易實現難，但如果不去行動，連實現的可能都不會有。",
"373":"世上只有一種英雄主義，就是在認清生活真相之後，依然熱愛生活。",
"374":"人生沒有彩排的機會，每天都是現場直播。",
"375":"成功不是將來才有的，而是從決定去做的那一刻起，持續地累積。",
"376":"看起來比登天還難的事，有時卻輕而易舉地做到，差別就在信念。",
"377":"你不喜歡我，我一點都不介意。因為我活下來，不是為了取悅你！",
"378":"生活中處處充滿著溫情，只要我們有一雙善於發現的明亮的眼睛。",
"379":"人的一生中不可能會一帆風順，總會遇到一些挫折，當你對生活失去了信心的時候，仔細的看一看好好回想一下你所遇到的最美好的事情吧，那會讓你感覺到生活的美好。",
"380":"人活著，要有所追求，有所夢想，要生活得開心，快樂，這才是理想的人生。上天給我們機會，讓我們來到世間走一遭，我們要珍惜，因為生命是如此的短暫，如果我們不知道珍惜，它將很快的逝去，到頭來我們將一事無成。",
"381":"生命就是一杯清茶，就是一支歌謠，就是一首耐人尋味的小詩！讓我們一路行走，一路品味，一路經歷，靜靜享受這美麗的人生!",
"382":"人活著，便注定了這輩子的奔波與勞累。有太多的選擇與無數的十字路口，這些太多的背後，我們只能選擇讓心去承受，學會沉澱。",
"383":"比你差的人沒放棄，比你好的人仍在努力，你有什麼資格說自己無能為力！",
"384":"如果生活踹了你好多腳，別忘了給它兩個耳光，反抗總比流淚強。",
"385":"別總是抱怨生活不夠幸運，是你欠了生活一份努力，每一個你討厭的現在，都有一個不夠努力的曾經，未來美不美，取決於你現在拼不拼。",
"386":"用盡心機不如用心做事，只有拼盡全力，才能輕而易舉。抱怨沒用，因為這個世界永遠靠實力說話。",
"387":"別哭窮，因為沒人會給你錢；別喊累，因為沒人會幫你做；別想哭，因為大家不在乎；別認輸，因為沒人希望你贏。",
"388":"不是每個人都能成為自己想要的樣子，但每個人，都可以努力成為自己想要的樣子。相信自己，你能作繭自縛，就能破繭成蝶。",
"389":"沒有一份工作是不辛苦的，也沒有一個年紀是不應該努力的。人生就是取捨，要麼拼，要麼忍。",
"390":"把委屈和淚水都咽下去，輸不起就不要輸，死不了就站起來，告訴所有看不起你的人：我很好。",
"391":"世上沒有白費的努力，也沒有碰巧的成功，一切無心插柳，其實都是水到渠成。人生沒有白走的路，也沒有白吃的苦，跨出去的每一步，都是未來的基石與鋪墊。",
"392":"不要認為自己比別人做得好，即便你很出色。",
"393":"一個有信念者所開發出的力量，大于個只有興趣者。",
"394":"傷害是別人帶來的，開心是自己尋找的，想哭就哭，哭完了接著笑，沒有人能把誰的幸福沒收。",
"395":"窮則思變，差則思勤！沒有比人更高的山沒有比腳更長的路。",
"396":"自信的生命最美麗！",
"397":"世上只有一種英雄主義，就是在認清生活真相之后依然熱愛生活。",
"398":"待人對事不要太計較，如果太計較就會有悔恨！",
"399":"你要做的就是別人換不掉的，那你做不到怪誰，就是你自己沒用！",
"400":"沒有不進步的人生，只有不進取的人！",
"401":"用愛生活，你會使自己幸福！用愛工作，你會使很多人幸福！",
"402":"含淚播種的人一定能含笑收獲。",
"403":"把周圍的人過濾一遍，縮小朋友圈。",
"404":"什么事情都可以拖一拖，沒必要那么著急，事緩則圓。",
"405":"親人是父母給你找的朋友，朋友是你給自己找的親人，所以同等重要，孰輕孰重沒那么多分別。",
"406":"與跟生命有關的人耗著，少與生命無關的事耗。",
"407":"我們可以失望，但不能盲目。",
"408":"在成功的道路上，激情是需要的，志向是可貴的，但更重要的是那毫無情趣的近乎平常的堅守的毅力和勇氣。",
"409":"這個社會是存在不公平的，不要抱怨，因為沒有用！人總是在反省中進步的！",
"410":"人與人之間的距離，要保持好，太近了會扎人，太遠了會傷人。",
"411":"朋友是路，家是樹。別迷路，靠靠樹。",
"412":"每一發奮努力的背后，必有加倍的賞賜。",
"413":"時光的殘忍就是，她只能帶你走向未來，卻不能夠帶你回到過去。",
"414":"努力去做自己該做的，但是不要期待回報，不是付出了就會有回報的，做了就不要后悔，不做才后悔。",
"415":"減少被別人利用的次數，學會減負。",
"416":"我不去想是否能夠成功，既然選擇了遠方，便只顧風雨兼程！",
"417":"當你感到悲哀痛苦時，最好是去學些什么東西。學習會使你永遠立于不敗之地。",
"418":"減少蝸居時間，親近大自然。",
"419":"我們什么都沒有，唯一的本錢就是青春。夢想讓我與眾不同，奮斗讓我改變命運！",
"420":"與人為善,善于吃虧。",
"421":"快樂不是因為得到的多而是因為計較的少！",
"422":"人之所以能，是相信能。 摘自 Chineseords.org",
"423":"豈能盡人如意，但求無愧于心！",
"424":"傳遞正能量的句子，充滿正能量的話",
"425":"我走得很慢，但我從不后退！",
"426":"善待他人，體諒他人，熱愛生命，努力生活。",
"427":"自己選擇的路，跪著也要把它走完。",
"428":"如果你的面前有陰影，那是因為你的背后有陽光。",
"429":"當我覺得我倒霉了，我就會想：這是在揮灑我的霉運，揮灑之后，剩下的就全都是幸運了！",
"430":"業精于勤，荒于嬉；行成于思，毀于隨。",
"431":"就算跑最后一名又怎樣，至少我又運動精神。而且我一定會跑完全程，只要跑到終點我就成功了！",
"432":"流過淚的眼睛更明亮，滴過血的心靈更堅強！",
"433":"看淡擁有，不刻意追求某些東西，落葉歸根，那些屬于你的，總會回來。",
"434":"把時間分給靠譜的人和事。",
"435":"學會寬容，要有一顆寬容的愛心！",
"436":"人生不可能總是順心如意的，但是持續朝著陽光走，影子就會躲在后面。刺眼，卻表明對的方向。",
"437":"很多時候，不快樂并不是因為快樂的條件沒有齊備，而是因為活得還不夠簡單。",
"438":"原以為“得不到”和“已失去”是最珍貴的，可…原來把握眼前才是最重要的。",
"439":"勞動的意義不僅在于追求業績，更在于完善人的心靈。",
"440":"心有多大，舞臺就有多大。",
"441":"把艱辛的勞作看作是生命的必然，即使沒有收獲的希望也心平氣和的繼續。",
"442":"忍受和奮斗就可以征服的命運。",
"443":"世上只有一件東西，能始終經受住生活的沖擊：一顆寧靜的心。",
"444":"每個人都有自己獨立的空間，再好的朋友也是應該親密有間的，別總把自己不當外人。",
"445":"當世界給草籽重壓時，它總會用自己的方法破土而出。",
"446":"常問自己，誰對我有恩還沒加倍報答。",
"447":"沒有傘的孩子，必須努力奔跑！",
"448":"傷心了難過了，一個人靜靜，不要在任何人面前掉眼淚，我不能原諒我的懦弱。",
"449":"人生就有許多這樣的奇跡，看似比登天還難的事，有時輕而易舉就可以做到，其中的差別就在于非凡的信念。",
"450":"沒有傘的孩子必須努力奔跑！",
"451":"善于與人溝通，適度采納別人意見。",
"452":"不要輕易用過去來衡量生活的幸與不幸！每個人的生命都是可以綻放美麗的只要你珍惜。",
"453":"懂得感恩，是收獲幸福的源泉。懂得感恩，你會發現原來自己周圍的一切都是那樣的美好。",
"454":"身體是自己的，健康是自己的，難受也是自己的，所以不要想吃什么就吃什么。",
"455":"經常笑，學會向比自己小的人稱哥，以保持年輕心態。",
"456":"心態負面的人接觸。",
"457":"前有阻礙，奮力把它沖開，運用炙熱的激情，轉動心中的期待，血在澎湃，吃苦流汗算什么。",
"463":"路是自己走的，小心點！",
"464":"人生的快樂在於自己對生活的態度，快樂是自己的事情，只要願意，你可以隨時調換手中的遙控器，將心靈的視窗調整到快樂頻道。學會快樂，即使難過，也要微笑著面對！",
"465":"守住心底那最美風景，成為一種風度，寧靜而致遠；守住記憶裡最美風景，成為一種境界，悠然而豁達；守住生命中最美風景，成為一種睿智，淡定而從容。"
}
