{
"0":"如果你覺得自己，整天累得跟狗一樣。你真是誤會大了，狗都沒有你這麼累。",
"1":"不順利嗎？多照照鏡子，很多事情你就明白原因了。",
"2":"有時候你覺得自己很平凡，就是個普通人。別難過，還是有機會特別一點，當個特別普通的人。",
"3":"有時候你會懷疑自己的能力，別擔心，偶爾你是對的，你能力真的有問題。",
"4":"小時候說到夢想，整晚都不想睡覺。現在說到夢想，只想趕快睡覺。",
"5":"男女之間一定有純友誼，每一個我認識的女生，都說最多只能跟我當朋友。",
"6":"為什麼總是天妒英才呢？因為沒人管笨蛋活多久。",
"7":"以前我以為錢可以買到一切，後來才發現沒有辦法，因為我錢不夠。",
"8":"罵老闆不懂愛惜人才，是一種很好的託詞。說的好像老闆如果愛惜人才，真能看上你似的。",
"9":"工作多年，當人家問你是不是出入社會，不是因為你看起來年輕，而是因為覺得你怎麼這麼笨。",
"10":"有些人說，看負能量久了會變負面思考。我笑了，說得好像你在思考一樣。",
"11":"有人說不要常抱怨，因為生活就是，如人飲水冷暖自知就好，我想問你被熱水燙到不會大叫嗎。",
"12":"越是沒有能力改變自己生活的人，越喜歡批評別人的改變。",
"13":"如果擺錯地方，鑽石也會被當作石頭。但石頭不管擺哪，都還是石頭。",
"14":"許多人的努力，只是為了欺騙自己和做給別人看的而已。他們都只是看起來很努力而已。",
"15":"人從不因夢想而偉大，而是因實現夢想而偉大。",
"16":"很多朋友喜歡分享旅遊經驗，看著他們把錢花光出去走一趟。回來後生活沒有任何改變，我就感到放心了。",
"17":"一些人常會被罵，說每天像豬一樣愛睡懶覺。真的是太委屈了，豬都比你早起。",
"18":"很多時候，不是你失敗了人家才批評你，正是因為你什麼事都沒做，還愛說一堆鬼話，才會被人批評啊。",
"19":"人家面試找工作，選的是薪水福利和發展前景。我只問一句：睡公司能開燈嗎？我怕黑。",
"20":"沒有人總是一帆風順的，其實你並不寂寞。看看你身邊的朋友，不就是因為失敗才混在一塊兒的嘛。",
"21":"人生很多事，終究是會隨著時間好起來的。像很多人原本只是胖，久了就變好胖。",
"22":"做個愛笑的人，其實更容易受傷。你總是笑，別人就覺得怎麼傷你都沒關係。",
"23":"誰說你沒有毅力的，單身這事你不就堅持了好幾十年嗎？",
"24":"有些人即使生活不盡如人意，也是看得很開。不是因為看透這世界，而是因為不得不這樣想，才能讓自己好過些。",
"25":"跟長輩聊天時，我們總是用盡方法想討他們開心，而長輩三言兩語就可以讓我們煩心。",
"26":"有時候覺得別人很膚淺，這不是偏見，因為他真的只是在敷衍你。",
"27":"當你失敗的時候，身邊會有一群關心你的人，他們會問你發生什麼事，聽聽你的失敗經驗，然後心滿意足地離開。",
"28":"這時代做什麼事，門檻都變得好高。想說當個宅男，還要先買得起房子。",
"29":"努力了這麼多年，但凡是有點天賦的，也該有點成功跡象了。",
"30":"大多數人愛嚷嚷做自己，不過是因為能力太差，無法扮演好社會的角色而已。",
"31":"用錢當然買不到快樂，只是有錢，別人會想辦法讓你快樂。",
"32":"很多人喜歡說：都是別人教壞他的小孩。那你怎麼不自己教好自己的小孩呢？",
"33":"長相是上一代給的，教育是上一代定的，觀念是上一代教的，環境是上一代留的，居然還好意思說：一代不如一代。",
"34":"現在都在鼓勵人們跳出舒適圈，但更多人從沒舒適過。",
"35":"雖然努力沒有什麼幫助，但是過程很重要。你可以發現自己真的是弱爆了，總有人輕而易舉就得到，你千辛萬苦才靠近的成果。",
"36":"你總是這麼努力，每天忍受許多寂寞與折磨，受盡委屈，但我們也沒覺得你多優秀。",
"37":"不敢跟別人說自己有認真讀書，是因為不想，用盡全力來證明自己腦袋不好。",
"38":"所有的工作，做久了都會覺得無聊。差別在於，別人無聊還賺得比你多。",
"39":"許多人所謂的追逐夢想，就是不想要辛苦努力地付出，還可以輕鬆自由地生活。生活就該像這隻賤賤的貓，喝掉毒雞湯，然後豁達向上。",
"40":"別再說自己是單身狗了，你那個年齡，狗都老死了。",
"41":"睡覺就像是給身體充電，但我從來沒滿電過。",
"42":"有時候你覺得自己很平凡，就是個普通人。別難過，還是有機會特別一點，當個特別普通的人。",
"43":"有時候你會懷疑自己的能力，別擔心，偶爾你是對的，你能力真的有問題。",
"44":"比你厲害的人比你更努力，那你還努力甚麼?",
"45":"幸虧當事者迷，不然真的看清事實真相，很多人是承受不來的。",
"46":"以前，我以為錢可以買到一切，後來才發現沒有辦法，因為我錢不夠。",
"47":"假如今天生活欺騙了你，不要悲傷，不要哭泣，因為明天生活還會繼續欺騙你。",
"48":"人生就是這樣，有歡笑也有淚水。一部分人主要負責歡笑，另一部分人主要負責淚水。",
"49":"如果擺錯地方，鑽石也會被當作石頭。但石頭不管擺哪，都還是石頭。",
"50":"你不怕變成自己所厭惡的人，我怕過得還不如他們。",
"51":"你要是喜歡一個女生，就從現在好好學習，將來找個好工作，掙好多好多錢，等她結婚的時候你再多出點份子錢。",
"52":"很多人不是心理疾病，而是心理殘疾，治不好的。",
"53":"做個愛笑的人，其實更容易受傷。你總是笑，別人就覺得怎麼傷你都沒關係。",
"54":"回首青春，你發現自己失去了很多寶貴的東西，別難過，以後還會失去更多。",
"55":"每一個想等事業起步之後再結婚的男人，最後都成了單身。",
"56":"很多時候被人對你，並不是因為喜歡你，而是因為他們就是喜歡對人好。",
"57":"大多數人愛嚷嚷做自己，不過是因為能力太差，無法扮演好社會的角色而已。",
"58":"用錢當然買不到快樂，只是有錢，別人會想辦法讓你快樂。",
"59":"努力不一定成功，但是不努力會很輕鬆噢！",
"60":"愛情就是，沒有更好地選擇了，我才陪你到天荒地老。",
"61":"如果你很忙，除了你真的很重要以外，更可能的原因是：你很弱，你沒有什麼更好的事情去做，你生活太差不得不努力來彌補，或者你裝作很忙，讓自己顯得很重要。",
"62":"別減肥了，你醜不僅是因為胖。",
"63":"對今天解決不了的事情，也不必著急。因為明天還是解決不了。",
"64":"你一直這麼努力，一定不知道耍費有多舒服吧",
"65":"過了今天，你應該知道：連假這幾天，應該都沒有人會找你出去玩了。",
"66":"以前覺得自己沒時間追夢，等到放假之後。才發覺自己根本懶的追夢。",
"67":"沒有每天來點負能量，以為生活可能會有點變化。但其實，一點改變也沒有。",
"68":"這世界這麼大，遲早你會找到一個容身之處。是你每個月剛好付得起的租金，還讓你每晚有點錢可以吃塊雞排。",
"69":"畢業到現在還找不到工作的話，就會有一種好像什麼工作都可以做，又好像什麼工作都不想做的感覺。",
"70":"很多人原本都可以享受戀愛的幸福，跟愛的人分享生活的快樂甜蜜。只可惜......隔天還要早起上班。",
"71":"同一件事，不同人做就有不同結果。向同樣是耍笨，你耍起來就像白癡；好看的人耍起來就變白癡公主。",
"72":"你看到有些人，明明你知道他賺的比你少。但生活品質好像過得比你好。那只是因為，對方比擬還愛面子而已。",
"73":"建議面試時，就算在緊張也別亂說自己耐操負責有責任感。那以後甚麼黑鍋都會是你背。",
"74":"有些人新作不順利就想回舊公司；新戀情談的不開心就會想找舊情人復合；憑什麼你會覺得別人都會在原地等你、接受你玩一圈膩了才回來呢?",
"75":"如果你發現你的朋友，開始自己煮早餐、晚上會去跑步、假日來個小旅行。最有可能的原因就是「他提離職了」。",
"76":"你脾氣這麼好，一定常常被逼著加了很多班吧?",
"77":"很多人看起來很有空喝茶，你不知道的是他在背後的努力。像是想辦法把事情都推給你，好有空去喝茶。",
"78":"如果你是那種每次買樂透就開始想著：「如果中了，要買好多東西...」。那你現在應該沒錢單身也找不到好工作。",
"79":"如果你是那種一喜歡新的對象就想著「如果在一起要為他做好多事。」，那你現在應該沒錢單身也找不到好工作。",
"80":"如果你是那種才投完履歷。就想著進公司後，可以做好多大事。那你現在應該沒錢單身也找不到好工作。",
"81":"人生很多事就像吃甜點。吃的時候很開心，但事後總是後悔一不小心就吃太多了。",
"82":"以前放假是吃飯出遊賞花賞風景；現在是吃飯耍費玩手機睡覺。結果我們居然還覺得現在生活越來越複雜了。",
"83":"以前要記很多人的生日寫賀卡，現在全靠臉書提醒生日然後發祝福。結果我們居然還覺得現在生活越來越複雜了。",
"84":"以前上課是：「你今天看起來好累，發生什麼事了?」；現在上班是「你今天看起來精神比較好，發生什麼事了?」",
"85":"壞女人愛男人的錢和權;好女人愛男人因有錢和有權兒產生的自信、寬大、精力充沛、樂觀進取。還好，殊途同歸。",
"86":"你我都渴望成功，哪怕要付出很多。但我們連早點兒起床都做不到。",
"87":"那些人人羡慕的精英，其實過得並不如你想像的那樣好，但肯定比你是強得多。",
"88":"什麼樣的人造就了什麼樣的國家，不要老覺得我們的祖國配不上你。",
"89":"以前覺得靠關係的人一定是很無能，接觸過後發現人家樣樣比你強。",
"90":"一些興趣和特長，拿來做業餘還挺NB的，但一旦變成職業，就弱得不行了。",
"91":"每個人都有幸福的權利，少數人有幸福的能力。",
"92":"最懂事的人往往最任性，最棘手的人往往最深刻。",
"93":"有些人，每天不花幾個小時幹點兒無聊的事情，就睡不著覺。",
"94":"單身是個很好的藉口，說得好像妹子們會看上你似的。",
"95":"真正努力過的人，就會明白天賦的重要。",
"96":"女生的冷暖自知什麼的，在長的好看面前弱爆了。",
"97":"很多人發現自己在錢、權、女人的問題上比不過別人，於是開始試著在道德和人生境界上做文章。",
"98":"以前跪著掙錢很少，於是我也模仿那些優秀的人，試著站起來。結果飯碗就丟了。",
"99":"懶是一個很好的託辭，說得好像勤快了就真能幹出什麼大事兒一樣。",
"100":"年輕人嘛，現在沒錢算什麼，以後沒錢的日子還多著呢!",
"101":"不順利嗎？多照照鏡子，很多事情你就明白原因了。",
"102":"女生們寧肯做高帥富的備胎，也不肯接受屌絲的行為，從基因上保證了人類的進步。",
"103":"社會學家研究表明：難看和沒錢的男人，並不比高帥富更加靠譜。",
"104":"如果你是個普通人，請一定學會應對挫折;就好象作為一條魚就一定要學好游泳一樣。",
"105":"我這張臉只要遮住兩個地方就完美了!一處是右半邊臉，另一處是左半邊臉。",
"106":"用心品味當下每一分痛苦，這樣在離世時才不會有所留戀。",
"107":"後來才知道，和不同的人說不同的話，表現出不一樣的態度，是一種非常可貴的能力。而不是虛偽。",
"108":"我在社會中混的不好，我好恨社會。但我離不開它，我生活中不多的美好，全是它給的。",
"109":"多照照鏡子，很多事情你就明白原因了。",
"110":"最丟人的事情是：你恨對方，對方對此毫不在乎。",
"111":"那些人人羡慕的精英，其實過得並不如你想像的那樣好。但肯定比你是強得多。",
"112":"掙錢是一種能力，花錢是一種技術，我能力有限，技術卻很高。",
"113":"錢是萬惡之源，但如果你沒錢，整個社會都會鄙視你。",
"114":"好多重要又緊迫的事情，先幹哪一件都會感覺別的事情被耽誤了。所以還是先上會兒網吧。",
"115":"有時候，你最想得到的人，其實是你最應該離開的人。",
"116":"有些女生覺得說自己是吃貨能顯得可愛。其實並沒有這樣的效果。",
"117":"沒錢沒事業的人，才有時間去提高自己的人生境界。",
"118":"所有抱怨社會不公和制度的人翻譯過來只有一句話：請給我金錢，女人和社會地位!",
"119":"又一天過去了，過得怎麼樣?夢想是不是更遠了?",
"120":"有些女生覺得說自己是吃貨能顯得可愛，其實並沒有這樣的效果。",
"121":"假如今天生活欺騙了你，不要悲傷，不要哭泣，因為明天生活還會繼續欺騙你。",
"122":"這個世界沒有錯，誰讓你長得不好看又沒錢。",
"123":"對今天解決不了的事情，也不要著急。因為明天也可能還是解決不了。",
"124":"努力了這麼久，但凡有點兒天賦，也該有些成功的跡象了。",
"125":"懶是個很好的託辭，說得好像勤快了你就真能幹出什麼大事一樣。",
"126":"我不怕變成自己所厭惡的人，我怕過得還不如他們。",
"127":"你費盡力氣想明白了一些事情，但對解決它們一點兒幫助也沒有。",
"128":"每天顯得無聊或寂寞了，去找朋友一起吃飯和逛，只不過是為了滿足自己與人交往的需求，算不上是社交。",
"129":"放下屠刀，卻砸了自己的腳。搬起石頭，就成了佛。",
"130":"努力了這麼久，但凡有點兒天賦，也該有些成功跡象了。",
"131":"醜女讓人注意她的內在美，長相普通的女孩讓人忽視。",
"132":"一些人的情商比較低，沒法扮演好自己的社會角色，只能一直以最真實的自己面對世界。",
"133":"你承受的苦難並不比他人多太多，痛苦主要來自敏感和脆弱。",
"134":"有的人喜歡說人人平等，說這話的人你能把錢給我花花嗎?",
"135":"身處高位而平易近人，富而行善，是比較簡單的。身處低處，要做到這點卻很困難。",
"136":"人生就是這樣，有歡笑也有淚水。一部分人主要負責歡笑，另一部分人主要負責淚水。",
"137":"要是有個地方能出賣自己的靈魂換取物質享受就好了。",
"138":"很多時候別人對你好，並不是因為別人喜歡你，而是因為他們喜歡對人好。",
"139":"每天思念著不該思念的人，做著與現實無關的事。",
"140":"轉角一般不會遇到愛，只會遇到乞丐。",
"141":"我看不起那些不如我的人，我嫉恨那些比我強的人。",
"142":"以前覺得靠關係的人一定很無能。接觸後發現人家樣樣比我強。",
"143":"你這麼努力，忍受那麼多寂寞和糾結，我們也沒覺得你有多優秀。",
"144":"世界上沒有那麼多出類拔萃改變世界的人，你、我、他只是這個世界的穩定劑。",
"145":"長得好看的才能叫吃貨，長得不好看的只能叫飯桶。",
"146":"長相不行的人，為人也未必好。只不過由於長久寂寞的折磨，有時會發瘋似地對人好。",
"147":"沒有人能預測未來，所以總有人後悔當初。",
"148":"有些人努力了一輩子，就是從社會的四流擠入了三流。",
"149":"總有這樣的人，該幹活的時候職業不起來，玩的時候又放不開。",
"150":"醜小鴨變成白天鵝，並不只是它有多努力，而是它的父母就是白天鵝。",
"151":"只有擁有找男女朋友的能力和很多備胎，才能真正享受單身生活。",
"152":"又一天過去了。今天過得怎麼樣，夢想是不是更遠了?",
"153":"可怕的是你平庸度過這一生，還要騙自己平淡是真。可怕的是你能力不夠，還騙自己說是知足常樂。",
"154":"沒有一個人可以徹底走進一個人心裡。",
"155":"是不是人在年輕時活得越沒有自我，才越會在老時拼命想從孩子身上索取點什麼。",
"156":"哪怕拋掉出身的因素，我覺得你也未必幹得過別人。",
"157":"自由從來不是什麼理所當然的東西，而是一項需要極高成本的特權。",
"158":"如果你特別迷戀一個人，那你一定配不上他。",
"159":"條條大路通羅馬，有人就出生在羅馬。",
"160":"只要是用錢能解決的事情，我一件都解決不了。",
"161":"人生三階段：出生、不知道在幹嘛、生命結束。",
"162":"沒有一個挖礦工人，靠挖礦當上了礦場老闆。",
"163":"我每天拼了命地努力，就是為了向那些看不起我的人證明，他們是對的。",
"164":"好好活下去，每天都有新打擊。",
"165":"萬事起頭難，中間難，到最後都難。",
"166":"有些人總是為了一點小事就請假不上班，反正我是不會這樣的。因為我怕我一請假，老闆就會發現沒有我公司營運得更好。",
"167":"那些曾經把我打倒的人，謝謝你們，躺著真舒服啊！",
"168":"那些瞧不起我的人！你們等著！我會讓你們瞧不見我的！",
"169":"現在窮怕什麼？以後窮的日子多著呢！",
"170":"不瘦下來怎麼知道你是真的醜。",
"171":"減什麼肥，臉醜跟體胖又沒什麼關係。",
"172":"當你覺得自己又窮又醜、一無是處時，別絕望，至少你的判斷是正確的。",
"173":"以後的路你一定要走下去，而我，坐車。",
"174":"明天還沒到，我就已經很累了。",
"175":"你要好好愛自己，因為我不愛你。",
"176":"一覺醒來，是不是感覺離夢想又遠了呢？",
"177":"你不努力，怎麼知道什麼叫絕望？",
"178":"世上無難事，只要肯放棄。",
"179":"過了今天，你就應該知道。連假這幾天應該都沒有人找你出去玩了!",
"180":"機會是留給準備好的人，只不過有些人出生就準備好了!",
"181":"很多人談戀愛，是想找一個人來遮風避雨。後來才發現所有風雨都是他帶給你的。",
"182":"讓我幫你看看今天的運勢：跟昨天一樣慘。",
"183":"其實這世界是這樣的：很多沒什麼夢想的人都實實在在地在過每一天，而那些成天喊著要追夢的人都還在為明天煩惱。",
"184":"很多人放不下過去不是因為他們重回重感情，而是因為不知道未來在哪裡。",
"185":"失敗有甚麼大不了的?你又不會只失敗這一次，很快就習慣了!",
"186":"我媽常跟我說找女朋友阿不要光是看人家的外表而已，還要看看自己的外表。",
"187":"不要為了讓別人喜歡自己而改變原本的樣子，因為要是你改變了別人還是不會喜歡你。",
"188":"你一直這麼努力，一定不知道耍廢有多舒服吧!",
"189":"以前覺得自己沒時間追夢，等到放假之後才發覺自己根本懶的追夢。",
"190":"很多人原本都可以享受戀愛的信服，跟愛的人分享生活的快樂甜蜜：一起逛街看夜景吃霄夜，晚上一起談心整夜也不覺得累。只可惜隔天還要早起上班。",
"191":"建議面試時就算在緊張也別說自己個性負責耐操有責任感，那以後甚麼鍋都會是你背!",
"192":"很多人看起蘭很有空喝茶，你不知道的是他在背後的努力：像是想辦法把事情都推給你好有空去喝茶。",
"193":"瘦的總有一天會胖、有錢的總有一天會花完。我只是比別人早點完成目標而已啊!",
"194":"很多老闆都會感嘆找了很多員工都不滿意。這很正常，因為你也不是讓人滿意的老闆!",
"195":"你所擔心的事有九成都不會發生，但是那一成就足以毀掉你一切的努力。",
"196":"小時候討厭那些愛討論八卦的人，現在斥己也整天掛在網上看八卦。現在說點別人甚麼就好像在罵自己。",
"197":"其實每個人對自己的過去都會有一樣的感嘆。當我們看到以前的照片時，第一句通常是「以前好瘦哦!」",
"198":"你看書一整天既不舒適也不快樂，沒人覺得哪裡不對；但只要你一躺著看手機就有人說這樣對眼睛脖子不好。他們並不是想為你好，只是看你過的爽他們就覺得不爽。",
"199":"會說認真的人最美麗，說的是那些原本就好看的人。向我要是認真起來三天不洗澡刷牙換衣服哪有甚麼形象可言?",
"200":"你要是歡樂，別人就說你虛情假意。但其實只有你自己知道「你只是口袋有錢」。",
"201":"你要是聰明，就覺得妳心機很重。但其實只有你自己知道「你只是口袋有錢」。",
"202":"你要是樂觀，就說你頭腦簡單。但其實只有你自己知道「你只是口袋有錢」。",
"203":"你要是自信，就說你太高傲。但其實只有你自己知道「你只是口袋有錢」。"

}