{
	"Permission_request": "เพื่อหาตำแหน่งสถานีที่ใกล้ที่สุด",
	"output1":"จากข้อมูลล่าสุดดัชนี AQI ของสถานีใกล้เคียงคือ %s",
	"output2":"สามารถมั่นใจได้ที่จะออกไปข้างนอก!",
	"Good": "ดีมาก",
	"Moderate": "ดี",
	"Unhealthy for high-risk group": "มลภาวะเล็กน้อย",
	"Unhealthy": "มลภาวะปานกลาง",
	"Very Unhealthy": "มลภาวะหนัก",
	"Hazardous": "เลวร้าย",
	"Lack_Data": "ข้อมูลไม่ถูกต้องไม่เพียงพอ",
	"Good_info": "ไม่มีผลกระทบต่อสุขภาพของประชาชนทั่วไป",
	"Moderate_info": "อาจมีผลกระทบเล็กน้อยต่อกลุ่มชาติพันธุ์ที่มีความอ่อนไหวมาก",
	"Unhealthy for high-risk group_info": "หากมีอาการเช่นปวดตาไอหรือเจ็บคอกิจกรรมกลางแจ้งควรลดลงเพื่อหลีกเลี่ยงการออกกำลังกายอย่างหนักภายนอกกลุ่มที่บอบบางควรสวมหน้ากากเมื่อจำเป็นต้องออกไปข้างนอก",
	"Unhealthy_info": "ในกรณีที่มีอาการเช่นปวดตาไอหรือเจ็บคอการออกแรงทางกายภาพและกิจกรรมกลางแจ้งควรลดลงและหลีกเลี่ยงการออกกำลังกายอย่างจริงจังในระยะยาวนอกบ้านแนะนำให้ใช้กลุ่มชาติพันธุ์ที่มีความรู้สึกไวสำหรับการอยู่ในอาคารและลดกิจกรรมการออกแรงทางกาย",
	"Very Unhealthy_info": "สำหรับกลุ่มชาติพันธุ์ที่ละเอียดอ่อนจะมีการเสื่อมสภาพอย่างมีนัยสำคัญขอแนะนำให้อยู่ในบ้านและลดกิจกรรมการออกแรงทางกายภาพประชาชนทั่วไปอาจมีอาการต่าง ๆ ขึ้นอยู่กับสภาพร่างกายของพวกเขา",
	"Hazardous_info": "หากภัยคุกคามด้านสุขภาพนั้นเร่งด่วนทุกคนอาจได้รับผลกระทบ ควรหลีกเลี่ยงกิจกรรมกลางแจ้งควรปิดประตูและหน้าต่างในอาคารและสวมหน้ากากและอุปกรณ์ป้องกันอื่น ๆ เมื่อจำเป็น",
	"Good_output": "ไม่มีผลกระทบต่อสุขภาพของประชาชนทั่วไป",
	"Moderate_output": "กลุ่มที่มีความอ่อนไหวเป็นพิเศษควรทราบว่า:   \nอาจเกิดอาการไอหรือหายใจถี่",
	"Unhealthy for high-risk group_output": "1. หากประชาชนทั่วไปรู้สึกไม่สบายควรพิจารณาลดกิจกรรมกลางแจ้ง  \n2 นักเรียนยังสามารถมีส่วนร่วมในกิจกรรมกลางแจ้งได้ แต่ขอแนะนำให้ลดการออกกำลังกายหนัก ๆ เป็นเวลานาน  \n3. ผู้ป่วยที่เป็นโรคหัวใจทางเดินหายใจและโรคหลอดเลือดหัวใจเด็กและผู้สูงอายุขอแนะนำให้ลดกิจกรรมออกกำลังกายและกิจกรรมกลางแจ้งสวมหน้ากากเมื่อออกไปข้างนอก  \n4. ผู้ที่เป็นโรคหอบหืดอาจต้องเพิ่มความถี่ในการสูดดม",
	"Unhealthy_output": "1. หากประชาชนทั่วไปไม่สบายควรลดการออกกำลังกายและกิจกรรมกลางแจ้ง  \n2 นักเรียนควรหลีกเลี่ยงการออกกำลังกายที่เหนื่อยล้าเป็นเวลานานและเพิ่มเวลาพัก  \n3. ผู้ป่วยที่เป็นโรคหัวใจทางเดินหายใจและโรคหัวใจและหลอดเลือดเด็กและผู้สูงอายุขอแนะนำให้พักในบ้านเพื่อลดกิจกรรมการออกแรงทางกายภาพสวมหน้ากากเมื่อออกไปข้างนอก  \n4. ผู้ที่เป็นโรคหอบหืดอาจต้องเพิ่มความถี่ในการสูดดม",
	"Very Unhealthy_output": "1. ประชาชนทั่วไปควรลดกิจกรรมกลางแจ้ง  \n2 นักเรียนควรหยุดกิจกรรมกลางแจ้งทันทีและปรับหลักสูตรในร่ม  \n3. ผู้ป่วยที่เป็นโรคหัวใจทางเดินหายใจและโรคหลอดเลือดหัวใจเด็กและผู้สูงอายุควรอยู่ในอาคารและลดการออกแรงทางกายภาพและสวมหน้ากากเมื่อออกไปข้างนอก  \n4. คนที่เป็นโรคหอบหืดควรเพิ่มความถี่ในการสูดดม",
	"Hazardous_output": "1. ประชาชนทั่วไปควรหลีกเลี่ยงกิจกรรมกลางแจ้งปิดประตูและหน้าต่างในอาคารและสวมอุปกรณ์ป้องกันเช่นหน้ากากหากจำเป็น  \n2 นักเรียนควรหยุดกิจกรรมกลางแจ้งทันทีและปรับหลักสูตรในร่ม  \n3. ผู้ป่วยที่เป็นโรคหัวใจทางเดินหายใจและโรคหลอดเลือดหัวใจเด็กและผู้สูงอายุควรอยู่ในอาคารและหลีกเลี่ยงการออกแรงทางกายภาพและสวมหน้ากากเมื่อออกไปข้างนอก  \n4. คนที่เป็นโรคหอบหืดควรเพิ่มความถี่ในการสูดดม",
	"info_test": "ข้อมูลสถานีที่ใกล้คุณที่สุดมีดังนี้",
	"O3": "โอโซน",
	"PM2.5": "ฝุ่นละออง",
	"PM10": "ฝุ่นละออง",
	"Error_1": "โอ๊ะเคียวรีดูเหมือนจะผิด",
	"Error_2": "กรุณาลองใหม่อีกครั้งในภายหลัง.",
	"Error_title": "มีปัญหากับการโหลดข้อมูล",
	"Error_subtitle": "โปรดกลับมาตรวจสอบอีกครั้งหลังจากนี้",
	"Error_location": "โอ๊ะฉันไม่ทราบตำแหน่งปัจจุบันของคุณ",
	"Error_no_permission": "ขออภัยแบบสอบถามล้มเหลวเนื่องจากไม่ได้รับการอนุญาตของคุณ",
	"return_hint": "แต่คุณสามารถกลับมาลองใหม่ได้ตลอดเวลา",
	"Error_out": "เกิดความผิดพลาดกรุณาลองใหม่อีกครั้ง.",
	"Error_GPS": "เกิดข้อผิดพลาดโปรดเปิดฟังก์ชั่น GPS แล้วลองอีกครั้ง",
	"Error_permission": "เกิดข้อผิดพลาดและไม่ได้รับการอนุญาตของคุณ",
	"from":"จาก %s",
	"Button_Title":"ดูรายละเอียด"


}